{
    "transcript": "# FINALLY! || Gukesh D vs Magnus Carlsen || Freestyle Chess Grand Slam Weissenhaus (2025) #\nhello everyone and welcome to the long awaited first Clash of uh world champion gukesh and Magnus Carlson it is their first game since GES became world champion and it happens in the final round of the well the sort of the preliminaries of the freestyle Grand uh chess Grand Slam vien house tournament and um as we know there are 10 players in the preliminaries and then eight players qualify for The Knockout phase so let's see what happens here gukesh has the white pieces and uh he opens with Pawn to f four and what I found very interesting was that um of course in every chess 960 official random tournament you get time before the actual game when there's a new position uh to think about the position to try new ideas but here they do it in pairs they do it you know five players uh uh you know uh on one board and five players on the other board and they don't know what the other guys are talking about and then they you know try and figure out new ideas then Magnus says this uh you know Norbeck says this leavon says this and then they uh sort of bounce ideas and they you know who knows what they come up with so it's an aspect of uh chest that does not exist in non Fisher random tournaments so I thought this was uh actually very nice and here you have um the the four Bishops stuck in the corner which means that as soon as those pawns come marching forward the Bishops are coming off the board and maybe it doesn't let's see what happened so Pawn to F4 makes sense you open up your strongest piece and we have Pawn to B6 the the light Square Bishop comes alive at B3 gkes opens up the dark dark Square bishop and knights to H6 by Magnus maybe saying okay you already pushed the pawn maybe this could be a nice Outpost for my knight we have Knight G to F3 and pawn to G6 already offering a trade of Bishops we have a trade Bishop captures Queen captures uh and now Pawn to G3 opening up the light Square Bishop as well and the question is do uh do you want to trade does GES move that sorry of course not like that that would be a silly trade uh does gkes at some point move the Knight and offer a trade so let's see what Magnus does he plays Pawn to C5 uh E3 and Knight to C7 and another interesting aspect of this position is the placement of the king and Rooks it looks as if you already castled in a weird way but remember black can still Castle Queen side and black can still Castle King side as can white so okay Knight D3 we have Pawn to F6 and Knight to F2 we have Knight to F7 both players um horsing around a little bit trying to find the proper Square for their Knights uh E4 and pawn to F5 by Magnus putting pressure on e4 we have Queen to E2 and pawn to A5 striking in the center uh F captures we have Knight captures on E5 Knight captures on E5 and queen captures on E5 and here GES should just kick away the queen and Advance the pawn to E5 when I say just I mean that's what our good friend um the engine had in mind but it also makes sense you know something like this and D5 you trade off the Bishops and you're you know you're very happy but gesh Castle King side it's it looks a little bit weird but once we Castle it sort of starts resembling a normal chess position and Magnus strikes in the center with Pawn to D5 maybe gues thought okay maybe Magnus castles King side as well even though you know well it doesn't look all that impressive uh but yeah Magnus goes D5 gash strikes with Pawn to D4 and now gues plays Queen captures on D4 again our good friend the engine says that white is just really bad here you should move the queen and there's no good move that you can make you you can't do any captures the queen and2 is hanging and if you play E5 to grab more space well then we can always uh go Knight to B5 and then we put pressure on the okay here Knight to B5 would be a little bit um not not the the the greatest as the B5 square is undefended but we could instead of let's say queen E7 go Queen all the way back to E8 and then if E5 Knight to B5 the Knight is nicely defended and uh well you you just have problems here your base of the pawn chain is attacked you don't have support for C3 also Knight to C3 being threatened this is um this would be very bad so that's why uh best for Magnus would be just to go all the way back to E8 however Magnus snatched the pawn and now gkes gets um uh well a couple of very important moves in he plays e captures on F5 G captures and now Rook B to D1 we have Queen back to G7 by Magnus and now Knight to H3 uh Rook to f8 hoping to get F4 in to maybe H put pressure on gha's King and pawn to C4 we have Castle's Queen side now uh and Knight to F4 okay the F5 Pawn has been blocked the D5 Pawn is attacked there is nothing for Magnus to do but to advance that D Pawn but first let's get the Rook to a better Square Rook to E8 attacks the queen Queen D3 and now Pawn to D4 Magnus creates a pass pawn and also offers a trade of light Square Bishops we have a trade Bishop captures Knight captures and now Queen captures on F5 so gukesh wins back his material and Magnus has to decide what to do here does he move the king and allow the Queens to remain on the board or maybe as gha's king is a little bit safer now maybe the way to go is to trade Queen so he does it he plays Queen to D7 we have Queen captures on D7 Rook captures and now sorry Rook captures and Knight to D5 uh let me just uh fix that a little bit sorry about that sometimes the the interface freezes yeah Knight to D5 and Rook to G7 and okay we have Rook D to E1 offering a trade and now Rook captures an E1 we have Rook captur on E1 and now Knight to C7 Magnus wants to trade off the uh the other Knight as well but if gkes trades then uh Magnus will have this pass to D pawn and uh well maybe it's better to have the knight in the game to to blockade the pawn so here goes um after Knight to C7 we have Knight to F4 King to D7 and now Rook to E5 uh here gkes says that he might be interested in more than just a draw here that uh he has the more active pieces and that he wants to play Rook H5 and uh you know try and get his King up the board try and push the pawns he does have two versus is one on the king side so world champion is still playing this for the win we have Rook to E7 Magnus offers a rook trade and the gach declines Rook to H5 and now while Magnus could go down the board uh it could be very very dangerous because this Pawn Falls with check and then if you try and hide your king here then GES gets to push his pawns here you know it'd be maybe two double edge so Magnus goes Knight to E8 uh we have Rook to H6 and now Knight to D6 we have Knight to D5 putting pressure on The Rook Rook F7 and now Knight to F6 with check we have King to d8 and Knight back to D5 Knight to F5 attacking the rook and Rook to E6 we have King to D7 chasing away The Rook Rook back to E2 and now King to D6 so Magnus gains some uh valuable uh space with his King and also kicks away The Rook all the way back to E2 we have Rook to F2 and now Pawn to B5 Magnus wants to Capt on C4 to have a potential Rook B7 Rook B2 Rook B1 in the future if needed so King to F1 and now B captures B captures and King to F5 Magnus starts getting his King into the game King E1 we have Knight to D6 and Knight to F4 now uh with ideas of Knight to D3 check as D5 is unavailable to the black king So by doing so he could win the C5 Pawn so Magnus defends it we have Rook to C7 and rookie to we have King to F5 and now gu should just play Rook F2 threaten some nasty discoveries and just keep checking that the black king if Magnus decides to enter the position however uh gukesh played Knight to D5 attacking magnus's rook and now Magnus has already a winning position and the problem for gkes is that it's not that easy to spot Magnus just goes to B7 and uh well now now The Rook is uh very much activated H3 and now Knight to E4 not only getting the Knight into the game but threatening Checkmate Rook B1 is the threat of Checkmate Pawn to G4 with check King E5 and now King to F1 but Magnus just plays Pawn to D3 attacks The Rook Rook e one and King to D4 and he was in this position on move 46 that gesh domaru resigned the game as there is nothing more to be done here magnus's king is too active and um well a couple of moves more can be played let's say go Knight E3 Magnus pushes the pawn you block with the Rook or maybe even a knight F5 check King to D3 you give a nice check King to C2 you you pin the pawn but then all you know just a nice Rook B1 check you cannot go to F2 you have to go to G G2 and then Rook E1 and you you force a trade and you promote this Pawn into a queen and win the game so it was a very nice game by by both of them gukesh held Magnus to a draw uh but when it came to the end game he gukesh wanted more he was not interested in a draw he wanted to beat Magnus and that uh well I believe was the cause of his downfall and also just Magnus you know playing very well but it's not difficult to play well when you you know give Magnus Rook B7 it's so you know like the old schit quote when he defeated lasar he said that you know he may be an old lion but if you you know stick your hand uh in his mouth he can still bite it off so that that's pretty much what happened here so that's the game hope you guys enjoyed both of them are going um into into stage two of the tournament of course n of them is being eliminated and we will also get maybe a nice Clash classical clash between the two of them again also in in fishal random time uh in fishal random uh board setup so that's the game hope you guys enjoyed it first ever game between GES and Magnus since gues became world champion Ends by Magnus winning with the black pieces so there we have it I would like to thank Ronnie lav Andreas Rosal Andre sh David bacon and Andrew steinel for a contribution to my channel thank you a lot I really appreciate it as as usual you can check two of my previous videos here thank you for watching and I will see you soon continuing to check up on your wonderful suggestions and whatever else happens in the Chess World thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "FINALLY! || Gukesh D vs Magnus Carlsen || Freestyle Chess Grand Slam Weissenhaus (2025)",
        "published_at": "2025-02-08",
        "view_count": "115788",
        "like_count": "3405",
        "comment_count": "365"
    },
    "comments": [
        {
            "comment_id": "UgzulYPV-o7A4uW82Yh4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@amanjain5862",
            "date": "2025-02-08",
            "likes": 170,
            "comment": "Spoiler Sheild😊",
            "num_replies": 1
        },
        {
            "comment_id": "Ugw8qfTvHZ0hAa77vv14AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@davidjohnson3913",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Gukesh is truly the Anti-Ding as World Champion…. Ding hid for the better part of a year, valid reasons or no, but Gukesh just instantly started taking on all comers, and playing his matches to win!\n\nRespect and Love for Gukesh!🎉🎉🎉",
            "num_replies": 0
        },
        {
            "comment_id": "UgzLelY4Js1GwDyfjRB4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@sundertooth1666",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "7:06 white not taking on h7 seems like a blunder here",
            "num_replies": 0
        },
        {
            "comment_id": "UgzQauTZLhFd8hHi7Kd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@subuddhparekh",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "7:06 why does white not play Nxh7? It looks like a free pawn?",
            "num_replies": 0
        },
        {
            "comment_id": "UgxcIzjJdqFdCsA2t-94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@WalterWhite.818",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "The thing is, I would never accept a draw from Magnus either. Magnus is known for playing out any position he thinks he has the slightest edge in, even if it’s completely equal. So to me, if he’s offering a draw he must realize he’s worse… so ya I’m gonna try and find out why (and fail, but try none the less!)",
            "num_replies": 0
        },
        {
            "comment_id": "UgxOCt9qPZRriXJulhd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@waburt",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "These top guys seem to resign so early.   Here Agad had to show us why in like 5/6 moves!   Is it seen as \"disrespectful\" if you don't resign when \"down\"?",
            "num_replies": 0
        },
        {
            "comment_id": "UgwN5PiajpZ7bLAUdDV4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@stateofdecay2210",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Gucky is like a crocodile 🐊 in Chess while Magnus is like one of those giant massive crocodile in the dinosaurs era who just literally eats everything even the world champions 😂😂😂😂",
            "num_replies": 0
        },
        {
            "comment_id": "UgwQJqrtRA7xmNKQeZx4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@veniaminvysotskiy9598",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "This new chess is stupid",
            "num_replies": 0
        },
        {
            "comment_id": "UgxO41snE2maoBBbpS14AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@luckydickbig",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "The impostor was swept off the board",
            "num_replies": 0
        },
        {
            "comment_id": "UgzZFHAshx0fc9j5vA14AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@nihilistPenguinz",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh who? 😂",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzxp6v7o1989hFvd9F4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@rickharold7884",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "king magnus forever",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwn2mm7sT3HP4uJ8fh4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@johnpritchard5903",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "I dont understand castles queenside?",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw0G-_kI8u6ol-poN14AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@chanpuiafanchun4068",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh is super angry😂😂\nhttps://youtube.com/shorts/4ZTMZKPjyjw?si=SLNTfBxPEkNAwcVX",
            "num_replies": 0
        },
        {
            "comment_id": "UgzVG0e8MUimV2cXz9p4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@chanpuiafanchun4068",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh is angry😂😂😂\n https://youtube.com/shorts/4ZTMZKPjyjw?si=SLNTfBxPEkNAwcVX",
            "num_replies": 0
        },
        {
            "comment_id": "UgyrC8aULZgLldVg9Pt4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@chanpuiafanchun4068",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh is fighting with finance minister of india about the tax he had to pay😂😂😂\nhttps://youtube.com/shorts/4ZTMZKPjyjw?si=SLNTfBxPEkNAwcVX",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy9VQu59xUcyZThIcd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@t.n.dhyaneswar2700",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Magnus showed his endgame superiority",
            "num_replies": 0
        },
        {
            "comment_id": "UgzQiotONCJyvp2MEW94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@malibongwesibiya3253",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Dommaraju, I've come\n to bargain!!!",
            "num_replies": 0
        },
        {
            "comment_id": "UgzURPQ7XrGjORyvMv54AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@abhishekhgd",
            "date": "2025-02-09",
            "likes": 36,
            "comment": "This Magnus guy seems like a great player. Beating the World Champion like that",
            "num_replies": 3
        },
        {
            "comment_id": "Ugx1kPLlRmDUSlTk3Qd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@One_God-x1t",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "In his mindset, he could have drawn the game.. so he is actually equal to his ideal. He is not playing for world. He is playing for himself.  He drew, & than was playing for result. It could have gone both ways. Gukesh losing to Magnus no big deal. But if Magnus lost, it will be much big deal. I think he chose right.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwlCiX3Fwy2-ZOmQhB4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@sharps5082",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Can u put those freestyle chess to different folder, not intrested to see some joke chess videos on my front page ty",
            "num_replies": 0
        },
        {
            "comment_id": "UgzIqPwZK-XGQtbcW3h4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@Ojas97",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Thats alright, this is the time for gukesh to take risks, he has a whole decade of chess in front of him, although i think pragg will be the first one to surpass magnus",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyez9TrIA78IlW46gt4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@courtlandFDouglas",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "At 7:05... why can't Gukesh/White take the h7 pawn?  It will take an extra move to get back to the center, but now he'll have a 2-pawn advantage",
            "num_replies": 0
        },
        {
            "comment_id": "UgwUO_QhJjjQoioaLjB4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@mikeog2617",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "Yup end of the discussion he will never dominate like Magnus lol",
            "num_replies": 0
        },
        {
            "comment_id": "UgwwQFjoyhO2mBlHpl94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@xxxhristopher",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "This isn’t real chess",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzkl6w3TcgiQs1HDp54AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@arinzeikechukwu6430",
            "date": "2025-02-09",
            "likes": 3,
            "comment": "when the best player in the world and the world champion are two different person",
            "num_replies": 0
        },
        {
            "comment_id": "UgyR9LLt-PTY8RCvgqd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@arefnaderi6497",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "#suggestion Alireza vs sindarov",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz_1B-kLAUbw_ZD3fl4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@sunilsawai",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "How r chess piece placed",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy9sLODi-pCS_qVZY94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@NotSoSmart-ev7bu",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "The moment Gukesh pushed for win in endgame, it was a game over for him!",
            "num_replies": 5
        },
        {
            "comment_id": "Ugwny5hWR9Dq-sta6M94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@guptayush179",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "7:27 funny how you and Magnus looked at 7:28 and thought the only rook that could occupy the b-file was black's. Something mere mortals like Gukesh and I could never do.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxn7yxO3jlOHLF8Ezd4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@vrebds2484",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "4:45 beginners be 😳🤯😱",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw2JhFs2HlSayGrjZV4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@vimaldissector7983",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "A lion is always a lion",
            "num_replies": 0
        },
        {
            "comment_id": "UgyEySUX-JxP1iA1lFB4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@MaritimeSunset",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "I can't believe Gukesh is world champion, he sucks frankly. Such a sorry WCC. For me, Magnus will always be the GOAT. If he is not in the WCC it loses all meaning.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw8KooI1EJoZq_KaH94AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@Dailychesschannel",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Earlier i find chess 960 very much boring but after i watch this tournament i feel this format of the game exciting",
            "num_replies": 0
        },
        {
            "comment_id": "UgzJ2EMH9__DwPNnZpx4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@X1348-n3n",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "danke!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxiq9QbNE9p0X2wmK54AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@Hahahahaaahaahaa",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh playing for the win is exactly why he's the world champion instead of Fabi.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwi0rR_NK0s7m2LQvV4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@kamleshamareshbabuji1114",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh doesnt want to be like magnus.. i can see the smile on ur face when gukesh lost the game agadmator.. if u hate indians, then better dont post videos on indian chess players",
            "num_replies": 0
        },
        {
            "comment_id": "UgxqGos9mFsOHhnu1QV4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@gerardomorales301",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Walang ganang panoorin dahil sa kagunggungang ayos ng mga piyesa, parang ginagago ang tunay na nakakaintindi ng larong ahedres",
            "num_replies": 0
        },
        {
            "comment_id": "UgwU84ZkupXOnRaoWfF4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@devadathans5506",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Not the Magnus vs Gukesh we wanted. Gukesh is the classical champion, not 960 or blitz champion. And Magnus may pull out of Norway chess as well. We may not get the anticipated clash anytime soon.",
            "num_replies": 0
        },
        {
            "comment_id": "UgykU2okWYXxUUswDJJ4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@KennedyMister95",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "Can't wait for the classical match between those guys 😊😊",
            "num_replies": 0
        },
        {
            "comment_id": "UgwrUnaDQIA7dcEJSTh4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@StoneAgeDudemanGaming",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Im in love with this format.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz_OAH-dH8FHTR_tiR4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@eckroattheeckroat4246",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "Do chess engines actually understand how castling rules work in Fischer random?  Like would an engine know that the modified castling behavior is actually a legal move?",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzgoqr-I6n5WXZ-AeZ4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@GuyBaete",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "heeft niets met schaken te maken!",
            "num_replies": 0
        },
        {
            "comment_id": "UgykyZ-TTDMU9Lk_A7Z4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@mohammadomarfaruk825",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Very nice game",
            "num_replies": 0
        },
        {
            "comment_id": "UgyByMwmc0EYWJdrKip4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@amitjain11000",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh miles behind Carlsen",
            "num_replies": 0
        },
        {
            "comment_id": "UgzCBtjO8htTfP7KGm54AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@SpankMyMonkey_SpankItGood",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "That quote at the end doesn't apply here. Not even close. Especially since Magnus is not only still number 1 by a mile, but, let's be real, If Magnus wouldn't have stepped down there wouldn't have been a Ding nor a Gukesh world championship victory.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzEbBpM2F8Oa9Aes4d4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@billwindsor4224",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "Please advise, what is the starting position? (I looked for an explanation … sorry if I missed it.)  Thank you in advance.",
            "num_replies": 3
        },
        {
            "comment_id": "Ugydomy3xemPC5G6LNV4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@simonr-vp4if",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "It's not often you see the world champion play against a player with 165 higher ELO!\n\nDoes anyone know how long they get to study the starting position before white plays their first move?",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx_-Cu2ZB_9BtYW8Hx4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@otehlo86",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "At 7:06 would terrible things happen if white took pawn on H7?",
            "num_replies": 0
        },
        {
            "comment_id": "UgyWQ5RLA_-Ol6pbCdZ4AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@cxcxzc",
            "date": "2025-02-08",
            "likes": 1,
            "comment": "why gukesh didnt capture the pawn on h7 with a knight at 7:05",
            "num_replies": 2
        },
        {
            "comment_id": "UgyAsc2A1fHltMZ2hs14AaABAg",
            "video_id": "4Ug_lBoYf0A",
            "author": "@aronuchukwuezugo615",
            "date": "2025-02-08",
            "likes": 1,
            "comment": "In fisher random can there be bishops on the same square color?",
            "num_replies": 2
        }
    ]
}