{
    "transcript": "# We Have Certain Expectations! || Gukesh vs Caruana || Freestyle Chess Grand Slam Weissenhaus (2025) #\nhello everyone and welcome to another very nice game uh from the quarterfinals of the freestyle chess Grand slim vien house gukesh versus Fabiano Carana now some of you have been saying that it is weird to be calling gukesh world champion as this is a format where he is not a world champion but uh I don't know okay we we do have like the classic world champion the rapid the Blitz World Champion the Fisher random world champion but I I think we can agree that if someone is a classical world champion it is okay to refer to them as world champion wherever they go they go you know into a bar a world champion enters a bar and so on so I don't know if it's just me but I feel like U you know maybe if someone's a Blitz World Champion or or rapper world champion maybe we're not going to refer to that that title at every event that we cover but I think you know as far as classical goes uh simply as it takes a lot more time to achieve that like uh you want to become Blitz champ Blitz World Champion you you need to like invest two days and you want to become classic world champion you need to invest uh well you know a training camp of um maybe a month and a half and then you know uh the the world CH championship match over the course of the whole whole month it is a little bit different so I don't know just putting it out there but okay uh this is one position where I I think all of the games were very very interesting and this one is no exception so let's see what happened H GES with white opens with Pawn to F4 same is in the Magnus notb game as it simply makes sense the bishop and the queen will be going after those pawns and and unlike Magnus who was uh well rather unlike Notre Beck who was down to trading the the a pawn for the a pawn Fabi says Nope Knight to B6 we're not going to be trading any pawns here we have Knight to B3 and pawn to F5 so okay this definitely makes sense and this definitely makes sense so what comes after this uh Pawn to E4 also makes sense if captur a rook can come into the game or like Magnus did in the previous game you can play G3 and capture with the queen we have F captures E4 Rook captures and Bishop to D5 attacking the rook and um hindering G3 for the moment after The Rook moves we have Rook back to E1 Queen to G8 and now Bishop to F2 uh okay so what happens next Knight to G6 putting pressure on the F4 Pawn uh GES advances at to F5 we have Knight to F4 and Knight to E3 getting the Knight into the game nicely defending F5 putting pressure on the bishop and uh well most importantly defending that G2 Pawn as it was under attack so Pawn to E5 we have Knight Capt on D5 now eliminating the strong Bishop Knight F captures on D5 and pawn to G4 by gkes we have Pawn to C6 and Rook to A1 now preparing to play A4 and A5 and kick away the Knight and maybe go for a nice attack on the black king Knight to F4 we have A4 and pawn to A5 Fabby stops that Knight to C5 and now Knight B to D5 we have Knight to E E4 uh with some well maybe tricky ideas depending on what F plays like if fa played Knight to C7 here GES would be the happiest person in the world as he would deliver Knight to D6 a nice smattered mate but of course Fabi will not do that and he will even reinforce that D6 Square uh Pawn to G5 and Bishop to B6 offering a trade of Bishops which GES goes for we have Bishop captures Knight captures and pawn to F6 GES wants to create a pass Pawn even though it's only move 17 King to C7 so you don't have to worry about that Knight to D6 check and now Queen to G1 we have Pawn to D5 kicking away the Knight and F captures on G7 where I believe gkes was thinking that Fabby captures that pawn but Fab says Nope Queen to B4 he likes that um D2 Pawn instead and he's saying Knight to C4 is coming next and then this Pawn will be under attack and also this Pawn will be under attack okay we have Knight to C5 uh getting the Knight out of Harm's Way and now Pawn to D4 now the queen is threatening to capture the Knight and the best way to play this would be just uh promote this Pawn promote this Pawn get the Rook off of the eile capture on E5 defend G5 defend the Knight on C5 and everything is fine and you know your your knight remains on an excellent square but after D4 gkes went back Knight to B3 which is also very nice once the Knight hits C4 you don't have to worry about Queen cap some B2 and also Al the the D2 Pawn is nicely defended so Rook to E7 and now Rook to E4 with some maybe nasty threats of Knight captures and then you know Pawn captures Rook captures Rook if the queen moves if not you can capture the Knight on F4 so it's a very useful move however you put it but Fabby has something to say about that he plays Knight to C4 and the question is what can you play now now of course you cannot play Knight captur um on D4 as you get checkmated right away so that's out of the question uh so what can you do uh here Knight back to D6 is played by Fabby uh you could also maybe try some uh other moves but uh uh sorry first after Knight to C4 Queen to F1 is played now threatening all sorts of nasty ideas but um Fabi goes back Knight to D6 uh what else could you try here well it's a it's a very very tricky position with this queen to F1 move uh gkes actually prepared a a most devious trap even though it's very very hard to see what if Fabby just says all right let's double up here what was this queen to F1 Mo well gk's plan was Pawn to C3 it's really awesome as the Knight is defended and uh he's saying what do you do with the queen you you cannot remain here if you move the queen we're just going to capture the Knight and if you capture on C3 we'll still capture the Knight and you're just lost you're going to be down a piece and in a completely uh losing position so after Queen F1 Fabby says all right I can see what you're trying to do Knight to D6 and here gkes can play a lot of things and he played Pawn to C3 which is not a bad move it's actually the second best move but by far the best move uh here in the position is to play Queen captures on F4 and is just a very very uh strong move the problem is is that it's very very hard to calculate why it's a strong move of course it's not calculate uh if e captures an F4 is played uh if he captures an F4 which is by far the best move then you will capture The Rook as well and once the king moves you will play Pawn to C3 and then capture on um uh uh D4 with the Knight and you will have all the compensation you need and if black captures here you will get the B5 for your Rook which will also be excellent even even winning the problem after this queen captures on F4 move though is not what happens if that uh is played but uh what happens if Knight captures on e4 well nothing then you just play Queen Capt so it's very hard to understand why GES did not go for this probably because he found an idea that was just as appealing and that is Pawn to C3 which we've seen is the move that uh will be played uh so he might as well play it first and then capture Queen captures on F4 so maybe that's the idea fa plays Queen to C4 and now Queen captures on F4 uh definitely the way to go and a play a way to play for the win for gash but no he plays Queen captures on C4 he trades Queens uh and that's uh well well that's it uh regarding his Advantage we have Knight captures on D4 okay also possible as The Rook is undefended Knight to D6 attacking the rook and now Rook captures on F4 this is what gukesh found and probably why he uh deviated from that winning line e captures on F4 and now Bishop to B3 saying that he will now promote the pawn and should Fabby capture on G7 he will play Knight E6 check and pick up the lonely Rook on G7 uh so after Bishop to B3 King to D7 Fab is not falling for that he finds how how to continue and now you have to play G8 Queen Rook captures Bishop captures on G8 now comes Rook to E1 also with check we have King to C2 and now Rook captures on A1 Bishop captures on H7 and now King to E7 and it's perfectly fine still you you can play Bishop to D3 and if Fab goes after the H Pawn you can play Knight F3 and everything is defended this is defended this is defended and you just continue the game but gukesh rushed he played Pawn to H4 and na Fab just brings The Rook Rook to H1 we have Knight to F3 and now Rook to H3 there's no way to defend both of them uh but the the H Pawn is least of your concerns because after Knight to E5 Fab just played Pawn to F3 the pawn is now uh almost the queen we have King to D3 King to E6 attacking the Knight and now Pawn to G6 by Fabby uh by GES the problem is if you go Knight G4 then we just play Rook captures on H4 and we win uh material if you play let's say Knight to G6 then just King F7 and again if you give a check you go after the bishop and if the bishop moves now F2 check and now if let's say King to E2 you will play Just Knight captures on e4 and win a piece that way so after King E6 gukesh cannot afford to waste time he plays G6 he also wants to promote his Pawn into a queen uh Knight to F5 there other moves you can play like King captures on E5 is perfectly fine Pawn to F2 check is perfectly fine but Fabby is a perfectionist he plays Knight to F5 now also takes away the E3 Square from the uh from the white king we have Knight to F7 and now King to F6 H we have Pawn to G7 uh one last chance maybe if King captures then Bishop captures Knight and okay guash is still in the game but here we have Pawn to F2 check King to E2 and now why did uh why did Fabby push that pawn uh how do you win this game feel free to pause the video and win it for Fabby while I give you a couple of [Music] seconds it is of course the oldest trick in the book one that I have no doubt that you guys saw in a fraction of a second uh and for those of you who perhaps haven't the move is Rook to F3 this is what Fabby played and he was in this position on move 40 that gesh resigned the game as there is nothing more to be done here of course if the Rook is captured you just bring a Queen into the game and that is pretty self-explanatory and if you go King to F1 well then you run into Checkmate Knight to G3 check you have to move the king king G2 F1 you bring a Queen into the game and after King H2 Queen to H1 will be Checkmate so yeah beautiful stuff by by Fabby it was uh you know uh GES GES almost had it after this Knight to D6 move by Fabby uh he he should have gone for it Queen captures on F4 such a such a lovely move I mean you you either um win the uh take the two knights for the price of a rook which we know is of course winning uh and if uh uh this is accepted well this is just extremely extremely difficult to play and uh well I I I believe uh GES would have prevailed had he gone for this variation but yeah hard to hard to decide you know against a player like Fabby Queen captures on F4 it's a move you have to play uh especially you know you are the world champion people have certain expectations so yeah he probably thought the other line was was just as winning but unlucky for him his opponent was Fabby and Fabby says not today so hope you enjoyed it I would like to thank Andreas rosental Andre sh David bacon Andrew steinel and Yuri renko for your contribution to my channel thank you a lot I really appreciate it as usual you can check two of my previous videos here thank you all for watching and I will see you soon continuing the coverage of this uh well wonderful event until it finishes thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "We Have Certain Expectations! || Gukesh vs Caruana || Freestyle Chess Grand Slam Weissenhaus (2025)",
        "published_at": "2025-02-09",
        "view_count": "68756",
        "like_count": "2164",
        "comment_count": "321"
    },
    "comments": [
        {
            "comment_id": "UgxYisYmDeynlS9Xj-d4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@user-qh3mc1jx2w",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "while we don't need any explanation on what a world champions is. Why is no one talking about how well fabi played against gukesh in this round? it was almost perfect for me.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw2IpQN4XekCo68xn14AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@rickharold7884",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Fabi the monster strikes.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxmppllC5-tjywd1xx4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@KnightToRemember",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "#suggestion Warmerdam-Fedoseev Tata Steel 2025",
            "num_replies": 0
        },
        {
            "comment_id": "UgyQRUnqSB44oRTymmN4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@xethnyrrow",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "And it was in this position, upon entering a bar, that Gukesh became World Champion, as there is nothing more to be done.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyfQW_-MO8N5yaAQkx4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@ahadassassin",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Classical is the b st format",
            "num_replies": 0
        },
        {
            "comment_id": "UgxI2CVk970-SHYxV2t4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@bernaridho",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Great play by Fabi.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzBA0Sx-UZ3DHATsUx4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@ferassoliman4441",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "فابي الرائع ❤🎉",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwl5Fze2_NdEkul9hd4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@shivaprakashbteli7465",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Gukesh supporters assemble ❤..",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw973HBvPRkj-Uuyrx4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@sourabhjangid8013",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Looks like you have been reading Dostoevsky lately.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwriTdrq2Lmi7YL_sV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@doctorshoot",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Love freestyle \nSo creative",
            "num_replies": 0
        },
        {
            "comment_id": "UgxlPNmlRblNjyx5iRR4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@Caleb-zu1pk",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Click bait",
            "num_replies": 0
        },
        {
            "comment_id": "Ugws-11XFsI-0M-RMAB4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@plavyn",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Agad saying that sacrificing the queen is the easiest thing to find",
            "num_replies": 0
        },
        {
            "comment_id": "UgwO_gXMbzDI8LluLcF4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@plavyn",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Haven’t heard anyone complain about GD being called world champion",
            "num_replies": 0
        },
        {
            "comment_id": "UgwNJxElt7STQIBfFUp4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@amitjain11000",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Gukesh losing with white pieces to both Fabi and Magnus show he still has some distance to travel.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxtm5NQJ1OAwXr5ggl4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@Waytogoneeerr",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Haha no one was crying when Gukesh was crushing everyone in the Recently held Tata Steel Classical. He is a Classical Monster, that’s all there is, that’s why he is the Champion.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzD0Bo1ghvkuIg0Gwd4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@chintanshah6234",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "I really hate that Gikesh lost to Magnus .. sure there was no winning position but I just saw that there were few chances where if Gukesh would have pushed then he would have won.",
            "num_replies": 2
        },
        {
            "comment_id": "Ugxy-UEVFatBU79ZyhF4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@varmmanelangkovan3206",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "At 10:13 , does ng2+ work??",
            "num_replies": 0
        },
        {
            "comment_id": "UgztMBNUUEHm3lx7oeV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@ancientscience8460",
            "date": "2025-02-10",
            "likes": 3,
            "comment": "Gukesh getting so much hate actually shows he has burned many a$$e$ on his way to sit on the throne. It's fine, not every King is liked by his subjects during his reign, but he still is the KING and they are his SUBJECTS. Kinda loving this hate lol.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzCEyrvtKyGOgyUby54AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@naldebol",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "The title is meaningless.  The champ in chess is unlike in other sports.  He is not the best in classical. \nHe simply won a match, but the match was not vs the best of the world. \n\nChampion before was the winner among the very best. \n\nMagnus Carlsen is the best and he is the champion even if unofficially",
            "num_replies": 2
        },
        {
            "comment_id": "UgwTflJdBafOyY1eroR4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@DavidAnderson-m5c",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "A happy world champion walks into a bar. \"What'll ya have?\" says the bartender. \"Your strongest whiskey\" says the champ. \"Ya got I.D.? 'Cause here the legal age is 21 and you don't look a day over 19.\" A sad world champion leaves the bar.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx8gCCgOtFacMTOo1N4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@karansingh-nt8bp",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "World champion when Magnus wasn't playing",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyesvb4gYSNuJQi6vx4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@K-hz8li",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "Whoever is telling u not calling him world champion is simply jealous that they didn't achieve anything at 18 in their lives \n#suggestion",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy1JFk2kxHYPfcUHft4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@karolmetal4256",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Another evidence that the Fide World Championship was a joke.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwv_G7UTN3i0_fss114AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@RyomenSukuna-vx7fn",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "The comment section of this channel has become a cesspool of naivety and stupidity thanks to Agadmator and Indian Gukesh fans. Both are jokers",
            "num_replies": 0
        },
        {
            "comment_id": "UgxfT1mPrTwaTNbNJ714AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@michaelmassaro4375",
            "date": "2025-02-10",
            "likes": 3,
            "comment": "Block my comments fine but if people are going to spam hate comments than I’m leaving a few too specifically for haters who see a Gukesh loss as a reason they can make disparaging comments about him .",
            "num_replies": 0
        },
        {
            "comment_id": "UgyveZ29a41mUnKOrNV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@LearnWithBahman",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Sure bus till Magnus is the real world champion.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzzGXuX613txZo_V6Z4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@Pavan_Aiyappa",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "Yes, it was not a problem when it was Magnus , yeah when its Gukesh everyone has problems !! Double standards !!!",
            "num_replies": 2
        },
        {
            "comment_id": "UgyEVwbN5grQ65gW7-F4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@nantakumaran3155",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Refer him world champiolook better",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz73idld9WODVcQCvt4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@flamencolo",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "The big boys teach the champion 💪",
            "num_replies": 0
        },
        {
            "comment_id": "UgxA8l3G7TlAh1yR7F54AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@mohamedkoblawi4175",
            "date": "2025-02-09",
            "likes": 4,
            "comment": "Man the nerve on this guy to leave a pawn 1 move away from promotion for this long. I could never 😅",
            "num_replies": 0
        },
        {
            "comment_id": "UgycUfWyj5Dd4qKvKFJ4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@luckydickbig",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "The impostor was swept off the board",
            "num_replies": 0
        },
        {
            "comment_id": "UgwuLsQv0kHCM8ImD1F4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@saeedyarahmadi9913",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Why i dont like this format of chess.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzoSQDjYrZk29brrn94AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@kaz2561",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "Gukesh is finding out what Michael Jordan once said: getting to the top is easy, but staying on top is even harder. :)",
            "num_replies": 0
        },
        {
            "comment_id": "UgzwytCrgKE6tGZkaIZ4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@thomasurbani1600",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Why no engine ?",
            "num_replies": 0
        },
        {
            "comment_id": "UgyrWqU1uFI802qLX8J4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@RabiChickenShop69",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "One variation which Fabi mentioned that he had calculated in the CBI stream (the position we have at 7:47) when he had 3 minutes on the clock\n\n28. Bb3 Re1+ \n29. Kc2 Rxa1\n30. Ne6+ Kb6\n31. Nf8 f3\n32. g8=Q f2\n33. Nd7+ Kc7\n34. Qxb8+ Kxd7\n35. Bc4 Nxc4\n36. Qxb7+\n\nThis he assumed is a draw somewhere and the evaluation from the computer confirms that, the thought process with less time is insane and this is what separates the elite super GMs!",
            "num_replies": 0
        },
        {
            "comment_id": "UgxxSCdG9yOUISbKrUV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@srh1034",
            "date": "2025-02-09",
            "likes": 3,
            "comment": "when you win the title randomly and become world Champ :))))))))",
            "num_replies": 1
        },
        {
            "comment_id": "UgwrX7eaYB-HqGDXxeV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@toppedbygock",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "I think that claim would have more validity if the actual champion cared enough to continue to play.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwIcLhyHdW9pNdoFhJ4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@Noelito40",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Anyone got any jokes, \"A World Champion walks into a bar...\" 😂😂",
            "num_replies": 0
        },
        {
            "comment_id": "UgxLKyJnlFHaTy4JASV4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@josua_w4052",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "i would suggest keymers game",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx5CkI1Innl5eFDtMd4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@naderghavidel8371",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Hello, Alireza is top seat and you have not covered any game (I.e vs Gukesh), appreciate if you can cover some of his games.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxFueJ74wyaJuSeS0l4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@EliteRaptor555",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Arjun would have played those crazy moves",
            "num_replies": 0
        },
        {
            "comment_id": "UgwGMUKhppMrBPvM9zl4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@sunnyy6295",
            "date": "2025-02-09",
            "likes": 4,
            "comment": "He wasn't practicing 960. He is just enjoying matches. His heart beat was 60. So, he didn't take it ss seriously as real chess.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwSWcaMC-Vl6VJFd0p4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@stephengreen6497",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "“Lovely” is my word.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz_GoSkFqya25znpL54AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@akmd114379",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Instead of saying world champion all the time just say champion of the tournament you're covering.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxpIYAOr3E-aujwZCt4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@northshores7319",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "This type of Chess clearly shows that young players can memorize opening lines well and know standard tactics but when it comes to 'just playing Chess' as Magnus would say they seem to fall short, as this game is a good example.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwvA8Shi3SpUm09buB4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@phdcmd",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Funny story about nickname agadmator. It is Indian",
            "num_replies": 0
        },
        {
            "comment_id": "UgwfFAdY-qTqYdi5Mdp4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@rajsub3884",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Had fabi been lucky as gukesh would have been World champion he virtually tied with peak magnus 2018 in all twelve match. Gukesh beaten some guy who never wom candidate got direct spot in candidate finished second get to plays thanks to magnus somehow wins in tiebrea after playing badly. Worst world champion defeating him doesn't give much significance . Retain next year beatinh some one worthy lets ses",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy2inbWC98lXL_LJZN4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@klevialushi571",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Gukesh can't beat weaker players than Magnus, nigs in the comments be like \"we need to get used with the fact that he is the world champion \"😂😂😂 like yeah, the title, but the real champ is someone else. I mean, it's not like he beat the best to get the title anyway xD 🤣",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwve996KLSpgezVRc54AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@ToXoGGG",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Please cover the other game, Keymer vs Alireza too 🫶",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw7qkdrvpVLX6EFifB4AaABAg",
            "video_id": "bpyNxWicuwQ",
            "author": "@kp-kq7ux",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "I don't think Gukesh has come to this tournament with any seriousness. At the beginning he himself said that the format is quite different from what he is used to and he had very little time after Tata steel to prepare for this one. It's reflecting in results.",
            "num_replies": 5
        }
    ]
}