{
    "transcript": "# \"Time to Retire!\" || Nakamura vs Sindarov || Freestyle Chess Grand Slam Weissenhaus (2025) #\nhello everyone and welcome to the third video we'll be showing from the quarterfinals of the uh freestyle chess Grand Slam vion house it isaro Kamura versus jaok sarov and this is their third game so two classical games ended in a draw even though no one thought it would go that far because as strong as Javit is Hikaru is the favorite here there I don't think there's anyone that um would disagree with that uh but here we are we are in the Rapids this is the tiebreaker and uh uh well jaok has the black piece that means Hikaru needs to win and he also gets some extra time uh to start so Hikaru starts with Pawn to F4 we have Knight to C6 by Joker uh let me just check where are the where are the ah sorry uh here it is uh Pawn to F4 and Knight to C6 I was missing the clock time so you can see hiar with 10 minutes on the clock jaok with 8 minutes on the clock we have Pawn to E4 and the immediate Pawn to E5 and now F captures on 5 if there are any Kings Gambit players watching this I'm sure you're you know almost jumping out of your chair right now because F captures on E5 is a big no in the king's Gambit uh but in in official random of course everything goes we have Queen captures on E5 and now Knight to C3 uh the engine really likes Knight to G3 here as the engine says that F5 is a serious thread from black and that you should stop that by playing Knight to G3 but of course players will not figure out all of the intricacies of the position especially since this is now a third game uh I don't know how how much time they had to prepare in between classical games but um yeah you're not going to uh spot everything so Knight to C3 H and now Bishop to B4 this was already a Miss by joer not launching forward with Pawn to F5 but okay Pawn to B4 we have Knight to F2 uh and now Bishop captures and C3 D captures and Rook to E8 I'm seeing that not in the sense that they should have played it or anything like that it's just show maybe how uh this chess is is vastly different from normal chess where where players would always play the top engine move when we're talking about move four or move five or move six not that they should you know play it or find it over the board we have Pawn to G3 and Knight to G6 and I think that will uh in in uh you know in turn give us uh more more interesting games overall so here Pawn to F5 G3 is basically hikaro fighting against Pawn to F5 because Here pawn to F5 you can play Bishop H3 and it's very very unclear so jaer just goes Knight to G6 we have Bishop to G2 and queen back to E7 we have Knight to D3 uh and uh we have Pawn to F6 nicly controlling the center stopping E5 opening up the light Square bishop and so on it's a very nice move Pawn to A4 and here jaok castles Queen side everything is cleared uh so you can do that we have Queen to F1 H and now Bishop to C4 pinning the Knight we have B3 challenging the bishop and now giving up the other Bishop as well so Joker is saying this will be a knight versus Bishop game c captures and now Queen to E6 going after the B3 Pawn we have King to B2 defending and now Knights to A5 and it seems like iaru opened up a little bit uh much here B3 Pawn already hanging I mean if you're not going to play Queen to D1 you should play something like Rook A3 and uh well Queen D1 does look like a pretty good idea does get the queen uh somewhat out of the game so Rook A3 although ugly looking is the best way to go and if you really want to know devaluation here the engine says is Hikaru is uh well almost uh if not straight out winning that's how good White's position is regardless of the pawns being pushed forward like this so here we have Knight to E5 uh and hearo goes King to C2 uh probably to add an extra Defender to this D3 Pawn or maybe to avoid all of the checks on C4 as he's preparing Pawn to D4 uh but D4 should be played right away there's no there's no danger here if you if you give this check you can simply capture and once the King goes back let's say King A2 yes you are uh I mean this looks very dangerous so you could play something like Knight E3 check it seems like you're going to lose the queen but no Pawn D5 and nothing is really happening here and if you decide to go after the Rook yes okay it's nice you've messed up white Pawn structure but how are you getting the Rooks into the game other than the two Rooks you have no more attackers you're not you're not winning this so uh instead after this um uh Knight to E5 move we have King to C2 by Karu King to B8 and now Pawn to D4 chasing away the Knight Knight back to F7 and pawn to D5 we have Queen to E7 putting pressure on the rook and hekaru just goes back Rook to A1 Knight back to E5 and now Bishop to D4 again uh Queen B5 straight out winning for Hikaru it's uh probably due to this being Armageddon Hikaru is uh not being his usual self like if this was a puzzle Rush moment Hikaru would play it without I I think spending a second here because he he is that good I mean there's no square for the Knight where is the Knight going you have to play B6 and then of course Pawn to B4 if you're you know on he car's level you don't miss queen B5 followed by Pawn to B4 and now after this mov you will play well Queen A6 A5 you will bust open the position and go after that A7 Pawn the bishop pair is attacking that black king so there there's no defending this but Hikaru played Bishop to D4 and now he allows jaok back in the game Pawn to C5 Bishop captures on E5 Queen captures and Rook to E1 adding a Defender to this E4 Pawn uh Queen back to D6 and now Queen to F5 Hikaru puts pressure on that H7 pawn and jaok even invites it Rook to E5 and queen captures on H7 and this is not the way to go for Hikaru not at all this is a pawn PA he doesn't need um uh in order to to win this because he has to win this we have Queen to B6 and now comes King to D1 here Rook 8 to B1 looks like a move that should be played but uh the I mean this Pawn to C4 move is just so strong it takes away uh very important squares here and there's just uh uh there's just no good reply here you could Advance the pawn you could ignore the pawn you could play captures and C4 but then the immediate Queen to F2 check and if you go down the board you lose the Rook if you you know you could also lose the bishop you cannot go to B3 if you go to D3 then Queen captur and G2 again and white has no good reply and on the other hand if you advance the pawn to B4 then the pawn is guarding these two squares and then again Queen F2 check and uh that's it if if King D1 you can even trade here captures captures but now Queen F3 check if King C1 then you capture um the pawn if King C2 then you go Rook to H5 attack the queen and Rook on H2 is coming next and the white king is getting checkmated or you know white will suffer severe material loss so after King to B6 we have King to D1 Hikaru will try and hide his King over to the king sign but already I think you can feel that Hikaru is not playing the one playing this for a win we have Queen captures on B3 check King E2 Queen captures on C3 and King to F1 and now Knight to B3 going after Knight to D2 check Rook a to D1 and now Rook to G5 uh we have Pawn to E5 hiar wants to open up his light Square Bishop maybe you know good good things will happen Rook captures on E5 Rook captures we have Queen captures and queen captures on G7 we have Pawn to C4 now hiari is not getting checkmated but the past C Pawn is just too strong Pawn to D6 opens up the light Square Bishop uh Pawn to C3 uh we have Queen a queen t7 offering a queen trade and uh okay Rook to E8 says okay we can trade but we're trading on E5 Hikaru says nope we're trading where I'm saying we're trading he wants the trade to happen on E7 so he gets a pass Pawn but Knight to D2 with check King F2 and now Queen to C5 with check we have Rook to E3 and look at this Rook captures on E7 he takes hikaru's Queen but it doesn't matter because hikaro will maybe get a new one H but not really Knight to E4 check blogs The Rook but interestingly H it'd be way cooler if this was the only winning line for jaer but you could also allow hiar uh Queen the pawn you could play King C7 and hiar brings the queen into the game you play Queen C2 you play C2 and you're going to bring another queen into the game there's no followup here The Rook is spinned the bishop is useless and there are no good moves for the queen so it's not it'd be cooler if this was the only way to win but it's not Knight E4 check now you cannot capture with the Rook obviously The Rook is pinned you have to capture with the bishop and now you are no longer uh the the defending E7 so Queen captures an E7 meaning that if you capture here then you lose the bishop as well so Hikaru starts advancing the H Pawn but now Pawn to D5 capturing of course Queen C5 pins The Rook attacks the bishop prepares to advance the C Pawn uh we have Bishop to C2 trying to block those pawns but just Queen C5 we have King E2 unpinning Pawn to D4 and now Rook to E8 with check King to C7 and now King to D3 Pawn to B5 and he was in this position on move 43 that Karo Nakamura resign the game as there is nothing more to be done here so against all chances we have jav in the semi-finals of the freestyle chess gr slam vien house he will be facing Fabiano Carana and Magnus Carson will be facing Vincent kimer so uh it's always interesting you know games between Magnus and Vincent they're always very very technical and in regular chest always packed with uh great Theory knowledge but uh you know I'm very very eager to see what happens um here in Fisher random uh I mean could go could go either way but so far no one even you know we we haven't even seen glimpses of anyone actually challenging Magnus uh in this in this format okay here you resign because what do you do I mean if you capture here then just Queen captures and uh that that's pretty much it uh it's check and there's uh not much for you to do if you capture here then you lose the Rook if you move also you lose the rook and if you go the other way around for example after B5 you could also so capture then again Queen captures yeah we already actually mentioned that but what what what else could you play if you just ignore you play Pawn to G4 then Queen to C4 check and now you go King to E4 D3 another check you go wherever you're going to capture the bishop You Queen the pawn and that's it you enjoy your your second Queen so after B5 Hikaru resigned there's nothing more to be done here and beautifully beautifully done by jaok very much looking forward to see what he can do against hi against Fabby he was uh well he's sort of the underdog um becoming the the Dark Horse I mean taking down Hikaru in any time format especially here where you have to calculate against Hikaru from one is a victory in itself so I'm very very eager to see what it does against Fabby and yeah uh Hikaru mentioned after the game that he has no idea what went wrong here he was very heartbroken he said that he you know it's time to retire definitely for him uh but yeah I don't think it was anything I I think he just stumbled upon a very very strong opponent who wasn't going to be bullied and Hikaru I mean should have played better I mean he he had him he had him over and over he was winning uh countless times here and then he just played something weird and then he decided for a completely wrong plan to go after that H7 Pawn so it definitely wasn't that he car that we're used to seeing where he just you know calculates everything in a fraction of a second and obliterates his opponent uh yeah this was uh not his not his game but uh jaok played well and he he defeated him so that's that's pretty much the story of this matchup like I said very much looking forward to what he does against fabbi as I mean Fab is also in a league of his own so hope you guys enjoyed it I would like to thank Andreas rosenal David bacon Andreas steinel Yuri renko and Nathaniel Devin for a contribution to my channel thank you a lot I really appreciate it as usual you can check to my previous videos here thank you all for watching and I will see you soon continuing to check up on your wonderful suggestions and whatever else happens in the Chess World uh thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "\"Time to Retire!\" || Nakamura vs Sindarov || Freestyle Chess Grand Slam Weissenhaus (2025)",
        "published_at": "2025-02-11",
        "view_count": "43387",
        "like_count": "1622",
        "comment_count": "146"
    },
    "comments": [
        {
            "comment_id": "UgwdXdsB3U2JS_4O5154AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@tipu._.9245",
            "date": "2025-02-11",
            "likes": 45,
            "comment": "4:56 this wasn't an Armageddon game. It was best of two rapid. Javokhir didn't start with less time, he spent two minutes on the first move",
            "num_replies": 9
        },
        {
            "comment_id": "UgxwC404N3q22ofwOEd4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@TheoTugnao",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "1970''s: You were saying Hikaru?😂😂😂😂",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy2IiuEj7DnRIrOUe54AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@KennedyMister95",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "5:27 this type of position should have a name gor themself. Like a crushing attack could be called \"entering the grinder\" #suggestion",
            "num_replies": 0
        },
        {
            "comment_id": "UgxzgDFUFdKxTv_8M314AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@ballboybatson9540",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "Hikaru and Magnus  both crashing and burning and not to each other",
            "num_replies": 0
        },
        {
            "comment_id": "UgxgTovntcdE0Mi19fp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@giovannicorno1247",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "Bravo Sindarov!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw2CozoT90BLZy-xQd4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@eigenfield",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "Fischer was right. Classical chess does something weird to your brain. What I see in this game, is the lack of pre-existing patterns for Hikaru to grasp on. Even the winning Qb5 he was not able to spot, does tells a lot that classical chess mastery is merely based on memory and not raw analytic power. And this is what Fischer was talking about",
            "num_replies": 0
        },
        {
            "comment_id": "UgyJuL3leuEV1YTrvkB4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@mytology",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "hikaru fuckamura loses in style",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzij_5JJbnd9U7CAOd4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@ayteejay3155",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "Antonio, pratim te i jako cijenim kako se trudiš ne samo da radiš super analize nego i da pravilno izgovaraš strana imena. No morao bi znati da Javokhir nije Englez nego Uzbek, pa se 'J' ne izgovara kao 'Dž', nego onako kako piše. ;-)",
            "num_replies": 0
        },
        {
            "comment_id": "UgwaVnXxpHKIsiBOrOt4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@fredflint3998",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "Poor Hikaru, it hurt my heart to see him that beside himself.  I’ve given games away much more won than this one.  Anyone who’s played some chess likely has too.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxcV5hN0HH85QQ5W3x4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@HabibAkbar-d9u",
            "date": "2025-02-12",
            "likes": 4,
            "comment": "The Great Bobby Fischer's Nobel and Great gift to the Chess Word Fischer Ramdon chess.",
            "num_replies": 1
        },
        {
            "comment_id": "UgxTZLrBF6jV3KyvdTV4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@iamtheiconoclast3",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Hmm... a top level tournament where only a specific underdog is able to screw up Hikaru's changes. I feel like I've seen that before...",
            "num_replies": 0
        },
        {
            "comment_id": "UgwJ6Yb53u6xEAPZvwl4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@theyaoster",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "L streamer",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz6jL4MDawMlvieHBp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@DarkKnightIndia",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "You enjoy your new Queen was personal 💀",
            "num_replies": 0
        },
        {
            "comment_id": "UgypJgBS_drwwHholud4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@anonymousanonymous-nt8ls",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "F hikaru. Dudes a chump. Niemann will be world champion.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyrtB4C51FA6oP--B14AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@tinot5093",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Both games he lost because he grabbed those pawns on H square.\nBad loser also.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzaDeWMj4fYAzSwSNV4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@isaki4869",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Thank you Agadmator for covering the Sindarov game vs Hikaru :)",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy5ZX2oET_42XMzktp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@LarbiElkeurti",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "#kasparov vs deepblue",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx-8r2Q4OyiNUqq0454AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@mtaur4113",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Most of us have very difficult losing wars against our limitations all the time.  He has had a phenomenal career and may still yet recover.  But he is set for life even if he doesn't, barring any truly idiotic behavior.  It kind of sucks on an existential level to always be one inch short of dunking the proverbial basketball, especially if you invest years or decades into jumping the highest that you can, and then you drop a millimeter or two.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwenMVnvmUFR9dhrZh4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@cattycats4",
            "date": "2025-02-11",
            "likes": 4,
            "comment": "Hikaru again was only concerned with himself and his ego, in a totally lost position he offers a draw... very disrespectful very unsportsmanlike. His interview basically was him crying about losing, a grown ass man throwing toys out of the pram",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxb_KBOmyRWiziTVP54AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@SaidKerimov",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Fed up with this freestyle chess. Absolutely not interesting",
            "num_replies": 0
        },
        {
            "comment_id": "UgxrWy54ZmaBU8V0-Ut4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@ronin7645",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "I just watched his after game interview and he mentioned retiring multiple times. It was the most dejected I've ever seen him. He mentioned he cant seem to keep it together in time crunches anymore, not just in this tournament, but lately in general, and he feels its time to retire due to that.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwnlhscxHp9UVl3dgB4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@michaelmassaro4375",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Great game by Sindarov he had a lot of composure in the endgame making some great moves . Seems like mistakes can happen moreso in random than regular chess . Just crazy at the end of the game it really accelerated at a quick pace . Thanks for the game Excellent Agadmator",
            "num_replies": 1
        },
        {
            "comment_id": "UgwkCA4yeCmEA-FvWgV4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@ДавлатбекҒаниев",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "Uzbek power",
            "num_replies": 0
        },
        {
            "comment_id": "UgwioaWn0diCLRrkVJJ4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@FloydMaxwell",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Love to see Bad4Chess lose",
            "num_replies": 0
        },
        {
            "comment_id": "UgzztYDkYj7vX9fghpp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@uzard3860",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "Can you specify which 960 position this is ? (I believe this one was #942 or it was the previous game maybe)",
            "num_replies": 0
        },
        {
            "comment_id": "UgxH0VtIOJx7GS7rqAt4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@xethnyrrow",
            "date": "2025-02-11",
            "likes": 9,
            "comment": "The video title throws so much shade on Hikaru.",
            "num_replies": 3
        },
        {
            "comment_id": "UgwXpu-yHAtFB7BUM514AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@darkprince9579",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Dislike to title!!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwri5ENkadlEVp5YKp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@TheMarksT",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "To become great in Chess you have to like a challenge!",
            "num_replies": 0
        },
        {
            "comment_id": "UgzYhLdOq2XU8TnQRGV4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@tenkdestroyertanki",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "3:13 why not pawn to C4?",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxl3cm3Hah_C9c1JiF4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@subashs5826",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "#suggestion Vincent vs magnus, beautiful game",
            "num_replies": 0
        },
        {
            "comment_id": "UgzMPi_xdaYpBEloDnF4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@judithstevehennenvacca8827",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Hikaru took down himself down.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw_uvkkaoppjva_ULZ4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@theccs5012",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "100",
            "num_replies": 0
        },
        {
            "comment_id": "UgxUPrQX2oSUKjBngmt4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@mrmiller74",
            "date": "2025-02-11",
            "likes": 2,
            "comment": "Our perception of Hikaru is all skewed because of Titled Tuesdays. They aren't really major chess events but because he dominates there we have him on a platform alongside Magnus. But he's actually nowhere near Magnus' level. He's never dominated OTB tournaments. He's never won a candidates. However, ironically he's talking about giving up classsical because he's struggling in these games now. But he's been struggling at rapid and blitz. So what he should really do is step back from TT and try and dedicate himself to one more candidates cycle. After that, sure give up and muck about with the speed runs and Freestyle, whatever. But at least give it one last proper go.",
            "num_replies": 1
        },
        {
            "comment_id": "Ugyw42iHp_vpCg2MuEh4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@toptier2800",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Hikaru needs to stop streaming and focus on chess, instead of being a part timer",
            "num_replies": 0
        },
        {
            "comment_id": "UgzaNcVDWMF9SAvjei94AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@itai82",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "Aga, you really hate hikaru, you need to be more objective.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwRnerX8Tk9YZ5zfEt4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@robw9986",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "Hikaru is getting too emotionally invested.  He should try to acquire more of a \" I literally don't care\" attitude.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzMY_e4LFkLtsm6NHt4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@yashmehta9299",
            "date": "2025-02-11",
            "likes": 2,
            "comment": "10:46 “You enjoy your second Queen” - Agadmator 2025",
            "num_replies": 1
        },
        {
            "comment_id": "Ugzpsd-Yj-Q0ChY5yBp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@Monika77ful",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "I saw it live. Maybe I can bring myself to watch later. Support comment.\nThanks Agad.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxirfpurZD7nJyEo-V4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@Lolwutdesu9000",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "at 4:30, engine says white is only up 1.5. Sure, maybe at the pro level this is enough to win, but it's definitely not game over.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzWeKKOaZgQtdxMzcN4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@mikeh2385",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Hikaru is losing it",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx5-7uqw83iedvlvLp4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@syedirfanahmad9626",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Defeating Hikaru means a good win",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzc6Ff6Iz3suMMZTvV4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@brukujinbrokujin7802",
            "date": "2025-02-11",
            "likes": 2,
            "comment": "Hikaru never the same since that lost against niemann",
            "num_replies": 4
        },
        {
            "comment_id": "UgyEMftCaRlYG3EqD0J4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@ahadassassin",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Why aren't they calling you ?",
            "num_replies": 0
        },
        {
            "comment_id": "UgwE8h8jPnlvflTvr9B4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@nicbentulan",
            "date": "2025-02-11",
            "likes": 3,
            "comment": "Ok but why is Magnus still too chicken to face AMERICAN Wesley & JEWISH Nepo in classical 9LX for the 5th year in a row?",
            "num_replies": 0
        },
        {
            "comment_id": "UgyROJvqMo-FVHYaJwR4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@PredragCrnkovic",
            "date": "2025-02-11",
            "likes": 6,
            "comment": "All that chips and other junk food plus no motioning and excercises finally and inevitably came to take their tool. \nEDIT: Ok, lingeri-geštapo, toll. Perhaps even tolls.",
            "num_replies": 2
        },
        {
            "comment_id": "Ugw04ef5dg8Bo9SmQ8V4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@HVH_49",
            "date": "2025-02-11",
            "likes": 2,
            "comment": "The future is now old man -Someone",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwd2ESc8Z5KeINaVid4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@nedmerrill5705",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "No country for old men.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzJs2rBdjURWFyYmzd4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@Philopantheon82",
            "date": "2025-02-11",
            "likes": 2,
            "comment": "The post match interview was infuriating, Hikaru was totally flabbergasted and exasperated to say the least. You could easily feel his downgraded emotions, bro should stick to online chess honestly!! He is certainly a legendary player but OTB ain't his territory anymore. He was talking as if he was in a confession chamber talking to an invisible priest",
            "num_replies": 0
        },
        {
            "comment_id": "UgyJvYaLIXnjcAt6Hax4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@Reimroboter",
            "date": "2025-02-11",
            "likes": 35,
            "comment": "hikarus the biggest problem is that he is tilting so quickly and talks himself down for very little reasons. then he starts to play worse and it becomes a self-fulfilling prophecy.",
            "num_replies": 4
        },
        {
            "comment_id": "UgzW0pXF7cnTqoNMk_J4AaABAg",
            "video_id": "E--vQzwg8q8",
            "author": "@KirubanithiKiruba-vo6ih",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Hiicaru minds might have gone to his bueatiful wife",
            "num_replies": 0
        }
    ]
}