{
    "transcript": "# What a Position! || Magnus vs Nodirbek || Freestyle Chess Grand Slam Weissenhaus (2025) #\nhello everyone and welcome to the quarterfinals of the freestyle chess Grand Slam vien house tournament Magnus Carlson versus n abdat is the first the game that we are covering uh it's a very very brief game and uh well just the starting position is is really wild uh as you can see uh there's a the the Queens are stuck in the corner on H1 and on h8 and also uh the kings are on the other sides of the board so it kind of makes sense and this is what everyone figured that we should open up um uh the position uh well just just to go after the uh the uh Queen side or rather the the side where the king is at and also the A7 Pawn is undefended so uh it's it's a very odd start to the game that's what I'm saying but let's check it out and you'll see what I mean by this so Pawn to F4 and pawn to F5 okay already the A7 and the A2 pawns are hanging hence the position from the thumbnail and uh they go they go for it right away just Bishop captures Bishop captures on A2 uh Pawn to E4 by Magnus and now Bishop captures on B1 notb being the first one to capture the exchange King captures and now F captures on e4 Magnus first goes Pawn to G3 he wants to capture with the queen and Notre Beck could defend with Pawn to D5 but then Pawn to D3 and you'll be sort of over committed uh to defending that pawn when really you want to develop your pieces uh so Pawn to C C6 by notbe and Magnus captures the pawn with the queen queen captures on e4 we have Pawn to G6 he also wants to develop his Queen and now Knight to E3 uh we have Bishop to B6 offering a trade of Bishops but uh really just asking okay will you please capture on B8 and of course Magnus will he does not want to want to be down the exchange for nothing we have captures captures and now uh Knight to B3 we have Knight to C7 and queen to B4 uh putting pressure on that bishop and Magnus is already uh looking at ways how to get the Rook into the attack as well can you play something like King A2 develop the bishop get the Rook to A1 move the king back or maybe C3 then move the king here so he wants to somehow use the uh the a file for attack we have Bishop captures on E3 uh notbe could also maybe try to put the bishop somewhere but where I mean on A7 it's only going to be uh a Target later on so he decides to capture D captures now Magnus also with ideas of E4 and D5 so Knight to D5 with Tempo attacking the queen and queen back to well not back but rather uh forward to A5 and now you really have to worry about that a file we have Pawn to E5 hoping that Magnus captures but of course he will not we have Bishop to F3 and now Pawn to E4 as also Bishop captures um on D5 would also just ruin Notre structure so Pawn to E4 Bishop to G2 and now Queen to G7 Norbeck now tries to get the queen into the game but Pawn to C4 comes with Tempo and yes it is opening up magnus's King maybe a little too much but uh uh yeah we have to get that Rook into the attack says Magnus we have Knight back to F6 and now King to C2 uh Queen to F7 putting pressure on that C4 Pawn but now Bishop to F1 uh there's no rusher we can always bring the Rook into the attack on the next move no way go Pawn to D6 and Rook to A1 and now Knight 8 to D7 getting the Knight to help out with the defense now Magnus brings the Knight to the center of the board Knight to D4 you also have to worry about about all sorts of sacrifices maybe Knight captures and C6 is a move Knight to C5 and now Pawn to B4 chasing away the Knight we have Knight to A6 you could also bring the Knight to D3 but it's not like it's doing anything there Knight A6 with have B5 uh c c cap on B5 and now uh the uh nice decision to Queen to B6 not recapturing right away and the question is what to do here if you could bring your queen into the game let's say queen to C7 then it'd be great but Rook captures on A6 is a huge problem so now you're just down a piece and there's no way to continue on the other hand after Queen to B6 you could maybe try Knight to D7 attacking the queen but then you get Queen captures on D6 with check and after Knight to C7 blocking Knight captures on B5 and um okay maybe you can try playing this uh Rook to C8 but it's still a very very ugly uh position to play so it it maybe maybe you can try it but uh it will still be winning for Magnus in the game Knight B4 check was played and now Magnus just play King to D2 and he was in this position on move 23 believe it or not that n abdat resigned the game as there is nothing more to be done here so okay two games are played in the quarterfinals so notbe will get his chance strike back but uh a very very well huge Advantage for Magnus um on his way to the to the semi-final match but okay Notre backck will also get white and we've seen how difficult it is to play Black in chess 960 uh so we'll see we'll see what happens here uh but yeah uh here it's even worse I mean you try something like Queen to C7 already Rook to A8 with check and you you're down a queen like captures captures or other than that if you try Knight to D7 here you know Queen captures and D6 and now you are you uh well you could try something but uh King to C8 has to be played and then Rook d8 check will be met with Knight to B8 and now Rook captures on B8 will be Checkmate so we could say it's uh even worse but yeah very nicely done by Magnus 23 moves uh I mean that's why uh you know some people love CH 960 or or fishal random some people don't like fish random uh but yeah you get a position like this and uh if you haven't seen my previous video I did discuss a little bit um players do get time before the games where they uh discuss the positions five uh players on this side of the of the playing hall five on this side and then you know they uh talk about ideas what they will use against their opponent so you everyone has a nice idea uh someone uses this someone uses that but usually they all go for the exact same opening I mean it's kind of agreed upon be before the game and uh I I guess no one likes the experiment here and uh you know uh players do get um great great ideas even in this little time they have before the game and opening up the the the queen and Bishop uh right right uh from the start going after those um uh Queens side pawns was definitely the way to go so very nice Lamb by Magnus we'll see what happens in the other games uh and yeah I would like to thank Andreas rosenal Andre sh David bacon Andrew steinel and Yuri renko for a contribution to my channel thank you a lot I really appreciate it as usual you can check two of my previous videos here thank you for watching and I will see you soon continuing to check up on your wonderful suggestions but mostly covering this event until it finishes uh thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "What a Position! || Magnus vs Nodirbek || Freestyle Chess Grand Slam Weissenhaus (2025)",
        "published_at": "2025-02-09",
        "view_count": "45189",
        "like_count": "1703",
        "comment_count": "83"
    },
    "comments": [
        {
            "comment_id": "UgwZMl3UQ3vWSqCIKt54AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@phineasgage8252",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "The spoiler block wasnt here :( damnit",
            "num_replies": 0
        },
        {
            "comment_id": "UgzyXJD1oSO8m8ksXbR4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@xethnyrrow",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Once Qb4 landed with tempo it was pretty much all over. Nodirbek's queen was no where to be found most of the game and had a very passive role even after development.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw7kS-AOEtozPWkzsh4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@VKarthik-kh7bg",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Nice explanation",
            "num_replies": 0
        },
        {
            "comment_id": "UgwQURXKjHhmJ44Oy-l4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@harrisahmedm",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Through this game, Magnus demonstrates a great principle:\nLet us not rush with captures when we know the piece is trapped and we can capture it anytime later, and instead use the time to develop pieces first.  \nHowever, one can usually afford to wait like this more often while playing with white than with black where reacting to white is more crucial, and so taking the initiative with capturing with black makes more sense. \nWhat a beautiful game by both the players!",
            "num_replies": 0
        },
        {
            "comment_id": "UgxeWQtIy-Bcj33FfbV4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@joebonek4102",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Freestyle chess is more more more interesting than normal chess",
            "num_replies": 0
        },
        {
            "comment_id": "UgzQnUTZvb-4W43IgvV4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@federerfan3",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Where is the fighting spirit of these guys? Why resign there? It reminds me of people playing against Djokovic ar grand slams, being 12 years younger and after losing 1 set, just playing it out not changing up anything tactically... At least play on and let him earn it, its not like he is checkmating him in 2 moves, don't just resign",
            "num_replies": 0
        },
        {
            "comment_id": "UgySfBC8KMs5kg5TFS54AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@switchblad333",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "I audibly wowed at Qb6, it is a great move",
            "num_replies": 0
        },
        {
            "comment_id": "UgwL8ZgQyQ2R60eOZcJ4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@brendanward2991",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Why does the chess robot not have F?",
            "num_replies": 0
        },
        {
            "comment_id": "UgxBrRo6-LRX35nawpN4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@DavidAnderson-m5c",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "One of the DISADVANTAGES of Fischer Random is that we, the viewers, who are almost ALL much more poorly skilled than the players, ALSO have to spend some 15 minutes evaluating the opening position. And yes, I know there's the \"pause\" button, but I watch these things from the comfort of a recliner; my monitor is on a desk; and as far as I know, the remote control for computer monitors has yet to be invented.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz2ANoVcdsYeHyar7l4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@DavidAnderson-m5c",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "This is one of those \"960\" opening positions that clearly favour White. There's no point even playing it.\n\nThat's why the standard arrangement offers so much possibility for either side -- there are no exploitable weaknesses out of the gate.",
            "num_replies": 0
        },
        {
            "comment_id": "UgywY5uLwLDxrFTZf2l4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@balbinat",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Some of these explosive, short, random chess games (with openings that literally nobody has played before) are starting to feel a bit like Morphy-style chess games. Immortal miniatures.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxbbdH0947NalQptrx4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@MahtabAlam-nw5rf",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Spoiler sheild 🛡️🛡️🛡️",
            "num_replies": 0
        },
        {
            "comment_id": "UgwRmzR7502Gy5huTMd4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@MatthewChippendale",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Nordibek is a grub",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyjte02UgEiGjC6FEB4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@kjfjdkiflfkd",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Algo",
            "num_replies": 0
        },
        {
            "comment_id": "UgyeQiZPtgdX2FTeqUd4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@EmperorThePro",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "No theory memorized = All these genz Kids fail.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyIigFBnedhyrCNd9t4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@akmd114379",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Who is leading the tournament at this point?",
            "num_replies": 0
        },
        {
            "comment_id": "UgwFUXys4eO9deq95TN4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Skwertydogs",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "My 👍🏻was #999. You're welcome next guy. You get to be like # 1K",
            "num_replies": 0
        },
        {
            "comment_id": "UgzcPp-EmFpasVfLQrt4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@gelatinousjoe7979",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "It is rough for black in chess 960 both objectively and practically. Great game by Magnus though.",
            "num_replies": 0
        },
        {
            "comment_id": "UgypSCHCTL4lXPNa4M94AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@cloudtheavegner1000",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "b4 was the winning move, as usual.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw7M-oTqojww2N4gzV4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@scoffingskeptic",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "Agad, that's such a bad picture of Nodirbek. Surely we can update it?",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz-7T9ifM4rODC5Ant4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@lindsaygaga4587",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "No theory is what i like about 960",
            "num_replies": 0
        },
        {
            "comment_id": "UgzxoK1sOQQmex187iN4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@giovannicorno1247",
            "date": "2025-02-09",
            "likes": 18,
            "comment": "I think Fischer-random will have an interesting future. Probably some of the starting positions must be eliminated because they favour White too much, but overall it allows finding new ways for theory.",
            "num_replies": 3
        },
        {
            "comment_id": "UgwliCxd8nxy7R8lBSV4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@kjetilknyttnev3702",
            "date": "2025-02-09",
            "likes": 50,
            "comment": "Magnus with an insane 98% accuracy in a fisher random game, with no previous opening analysis. That is crazy.",
            "num_replies": 2
        },
        {
            "comment_id": "UgyfHiv6xdz94IreSC54AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@yanni2852",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Magnus played like Alpha Zero this game…",
            "num_replies": 0
        },
        {
            "comment_id": "UgyTkAHLgt7EdqbZrRB4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@weeooh1",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Hate Fisher random. Because I learn nothing from its opening moves that can apply to standard chess. I usually skip to the mid or end of the game to when the game becomes 'normal'.",
            "num_replies": 1
        },
        {
            "comment_id": "UgwrOKHRjI-Jd-4GMIl4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@raymondsublett3108",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Where's that user### 🤡 at?",
            "num_replies": 0
        },
        {
            "comment_id": "UgwnkQkLygARO1pNtsZ4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@insanestuff9470",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "I got these positions too much on ultrabullet game",
            "num_replies": 0
        },
        {
            "comment_id": "UgylkkYpe4XMb_myPHx4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@loganlasvegas",
            "date": "2025-02-09",
            "likes": 4,
            "comment": "Freestyle… and as of move 1 we have a completely new game.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugykg_5EtfnkwqLHtpV4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@LarbiElkeurti",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "#kasparov vs deep blue",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyt7m-JQ4tylRmRkUp4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@simonl4523",
            "date": "2025-02-09",
            "likes": 16,
            "comment": "I used to skip videos with this format, but I have just started to really enjoy them",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzx5UC5dbxirQTYwuF4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@dauysal",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Random chess is disgusting",
            "num_replies": 1
        },
        {
            "comment_id": "Ugz2ov5rZHGVed6lW-Z4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@thesydmorrison2570",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "cant black just castle queenside and save the  rook?",
            "num_replies": 3
        },
        {
            "comment_id": "Ugxx5uB_Fn8Usgx8gs14AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@afterneet4421",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Magnus basically tortured",
            "num_replies": 1
        },
        {
            "comment_id": "UgwYcLA2VWeq7Q7JaRF4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@XeoMacNasty",
            "date": "2025-02-09",
            "likes": 11,
            "comment": "This is one of those positions in Fischer random that it seems like white has a major advantage",
            "num_replies": 4
        },
        {
            "comment_id": "Ugx_vkfvmFbcpYHUgXh4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Philopantheon82",
            "date": "2025-02-09",
            "likes": 16,
            "comment": "Such a positional and attacking masterpiece by Magnus in one game, also 98.7% is truly insane in freestyle aka 960 chess",
            "num_replies": 0
        },
        {
            "comment_id": "UgxweLc41B0iwQK7lcN4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@michaelmassaro4375",
            "date": "2025-02-09",
            "likes": 30,
            "comment": "Magnus did a great job getting his pieces to optimal squares he had a good idea of how to go about forming a great attack . Nodirbek could not find any good counterplay . Cool game fun tournament great players Thanks Agadmator",
            "num_replies": 1
        },
        {
            "comment_id": "UgxhsFlg7cF1U07dlmh4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@pututeguhdharmawijaya1722",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Poor rooks on the B file",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyxk6nWWkrP3WkmMvJ4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@andys_industries",
            "date": "2025-02-09",
            "likes": 1,
            "comment": "did bobby fischer ever play chess 960?...what was the game like",
            "num_replies": 1
        },
        {
            "comment_id": "Ugz2FPzH6Ho8zw0UuVR4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Monika77ful",
            "date": "2025-02-09",
            "likes": 6,
            "comment": "Thank you Agad for covering this great event.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx7V6-DYi5Z5x_78ip4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@himanshudevaliya",
            "date": "2025-02-09",
            "likes": 3,
            "comment": "Count me in for the Petition for freestyle chess ratings",
            "num_replies": 2
        },
        {
            "comment_id": "UgyZAd9NdKaqzKlfr_h4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Smithy316",
            "date": "2025-02-09",
            "likes": 6,
            "comment": "This is such an interesting competition, I love it 👌🏻",
            "num_replies": 0
        },
        {
            "comment_id": "UgxiY_DR90jZYvjw9-54AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Pamella-z6r",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Your videos are not just a spectacle, they are a real journey of knowledge and discovery. Keep up the good work!🏝🌓🚲",
            "num_replies": 0
        },
        {
            "comment_id": "UgwTssjd5MePMU84-4N4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@shaktiprasadkv2807",
            "date": "2025-02-09",
            "likes": 31,
            "comment": "MAGNUS 🎉98.7 accuracy in freestyle..Insane.",
            "num_replies": 2
        },
        {
            "comment_id": "UgwDAd7zYsj2sfyX9rl4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@hammy7528",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "Nodirbek has a very bright future ahead of him",
            "num_replies": 0
        },
        {
            "comment_id": "UgwHnqxC_Jc5h9y5DOF4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@ZPotch",
            "date": "2025-02-09",
            "likes": 78,
            "comment": "Who here doesn’t follow the games live so it doesn’t ruin Agads videos?",
            "num_replies": 8
        },
        {
            "comment_id": "Ugxu_f2k1Vdwa4CshLt4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Jasminehaydon",
            "date": "2025-02-09",
            "likes": 6,
            "comment": "That Dostoevsky quote is a bit too much for a chess game.",
            "num_replies": 2
        },
        {
            "comment_id": "UgxF7Bx3JVkZQpcFbVt4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Subartu22",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "Everyone fear of magnus, and\nmagnus fear fischer random position 😂",
            "num_replies": 0
        },
        {
            "comment_id": "UgxT2nqvxaxDziwgRA14AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@afrikind",
            "date": "2025-02-09",
            "likes": 4,
            "comment": "once i see i click although i have watched earlier but guess what...\nWhat  A Position and what a video...",
            "num_replies": 0
        },
        {
            "comment_id": "UgyONJTjbLK79ynqPfR4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Warbr33d",
            "date": "2025-02-09",
            "likes": 2,
            "comment": "Spoiler blocker 🛡️",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwb7QMpODGwiyvowBB4AaABAg",
            "video_id": "Q-FbTP7N1w8",
            "author": "@Blackstar25109",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "First",
            "num_replies": 0
        }
    ]
}