{
    "transcript": "# Too Strong For Weak Moves! || Caruana vs Gukesh || Freestyle Chess Grand Slam Weissenhaus (2025) #\nhello everyone and welcome to the second day of the quarterfinals of the freestyle chess Grand Slam vion house it is Fabiano Carana versus gukesh and in the previous game I don't know if you've seen it it was a it was a beautiful game by both of them but at a critical point in the game gukesh had to decide between two very very difficult lines one involved sacrificing his queen and the other one well in involved not sacrificing the queen but also was very promising uh gukesh went for the lad line and um it just wasn't enough to take down fa Indian GES even lost so now gkes has to win with black otherwise he is eliminated and Fabby goes into the semi-finals of this fine event and it's a pretty cool uh position and it's a pretty cool game a very very short one I think the shortest one that we've had so far uh even you know not so much in terms of moves even though it's very short it's 18 moves long but um uh I don't know you'll just see it's very hard to explain but the position is interesting like uh if you just for example they started with Knight B three Knight to B6 but already if you wanted you could uh bring the other Knights into the game and just Castle here so castles castles you would get some sort of a crazy position where the knights are out and the Bishops are nicely tucked in The Rook uh is where the Rook is supposed to be the other Rook as well and the queen almost basically on a starting Square so it's uh not something that uh would would confuse the players I would say as much as maybe some other positions uh but okay we have Pawn to E4 uh even in chess 960 one has to control control the center to win the game we have E5 Pawn to F3 and Knight to C6 we have Pawn to D4 e captures and Knight captures on D4 we have Pawn to F5 H it's a very interesting Pawn Sacrifice by GES it's hard to say if uh they figured it out before the actual game as they can discuss the positions a little bit or maybe gkes spoted it during the game but this F5 move took gues some almost 10 minutes on the clock and uh it's a very strong it's the top move recommended by the engine saying that uh okay yes you are giving up this Pawn but you are going after this pawn and gha's plan is very very sound but after Fabby played Knight captures on F5 gkes should have captured on A2 right away you capture it and after The Rook attacks Bishop you move uh away you play Bishop to E6 and you go after the Knight that is the best way to uh to continue this game but gkes first play G6 sort of comes with Tempo because uh well not just will you capture on A2 but you will also make maybe get to play Bishop to G7 which looks very nice but the problem is after Knight to D4 now you're kind of not in time to capture on A2 still captures Bishop captures on A2 but now Fabby throws in a knight captures and C6 uh C6 attacking The Rook on B8 as well and weakening the A7 Pawn uh so okay he did not play it right away he first played Rook to A1 but you can play it either way you can first capture on C6 and then Rook A1 or rook and one and A1 and then capture Bishop back to D6 and now he captures on C6 D captures and Rook captures on A7 uh we have Queen to E7 and already Queen to A5 so you can see that it's much much different and also uh it cost gues a pawn in the in the process while not getting all that much as you would get if if you didn't go for this G6 plan but okay Bishop H6 check we have Bishop to E3 blocking Bishop captures on E3 Knight captures on E3 and now castles King side it's a pretty long Castle but uh well if you don't forget that it's possible you know it's uh it's it's just there uh we have Queen back to C3 and now believe it or not there is very little that um that gukesh can do after this queen to C3 move uh well bkash played Rook to A8 he wants to trade off Rooks which makes sense he wants to activate his own Rooks and this Rook isn't very active here so Faby played captures we have captures and now Pawn to B3 Kesh can now go Queen to A3 with check or he can try some other plan but uh for example deliver delivering this check looks very strong but after Bishop D3 there's just no good way to uh handle it and you you you you'll just bring the Rook into the game Hide Your King over to the king side and you'll just enjoy extra pawn and a much safer King so gkes has to try something he plays Queen G5 goes after the king here uh and now Bishop to E2 just nicely developing preparing to to bring the Rook into the game Pawn to C5 going after fabi's Queen side but fabibi doesn't care now he's the one castling King's side we have Rook to d8 and here we have Pawn to F4 uh Pawn to F4 wasn't I believe even played uh let me let me just check real quickly uh it actually ended on castles yeah on castles it ended here gues saw the position and he was in this position on move 18 that gues do maraju resigned the game and with it is out of the competition Fabby proceeds into the semi-finals where he will face well whoever whoever wins some of the other games all of three are still being played and uh it's interesting here that there's no plan that um guesh can sort of come up with that will stop Pawn to F4 uh or or you know you're just going to allow the The Rook to claim the D5 for example you you you block The Rook on the D file simply advancing the pawn to F4 already wins the game like Queen goes to E7 f five there's I mean if you don't want to ruin your Pawn structure you have to go back F6 is coming and now you either you know allow instant game over like this or you maybe play Queen to F7 and then you give up the C5 Pawn now you're down two pawns and then this Pawn is coming to E5 and you will just you know commit yourself to some very very slow suffering and on the other hand after Castle's King side you could try to stop it with Rook to f8 this does prevent Pawn to F4 but then you give up the D file and yes the game continues by I think Lukes was just um so disgusted with his position that he decided to call the day wasn't his match wasn't his game uh he he he didn't want to you know uh even try maybe of course it is always possible that Fabby messes something up uh you know on a grand scale it would have to really be on a grand scale to mess this up but gues says Nope I resign and that's it fabbi is the winner and he is the one going to the semi-finals I could check up on some other games but I will also probably be making a second video on some of the games that finish so I will keep you guys informed on the on the results but yeah not not the greatest result for the reigning world classical Champion uh we'll see we'll see what's what's next for him and what great victories will he achieve uh in perhaps the next tournament so yeah I hope you guys enjoyed it brilliant stuff by Fabby I mean we are used to Fabby you know brilliantly dominating games like this so nothing nothing spectacular here I would like to thank Andreas Ros Andre sh David bacon Andrew steinel and Yuri renko for your contribution to my channel thank you a lot I really appreciate it as usual you can check to my previous videos here thank you all for watching and I will see you soon continuing to check up on your wonderful suggestions and whatever else happens in the Chess World thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "Too Strong For Weak Moves! || Caruana vs Gukesh || Freestyle Chess Grand Slam Weissenhaus (2025)",
        "published_at": "2025-02-10",
        "view_count": "45186",
        "like_count": "1646",
        "comment_count": "202"
    },
    "comments": [
        {
            "comment_id": "UgxJ83E6l8C_mWwp4Jh4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@its.not.",
            "date": "2025-02-12",
            "likes": 0,
            "comment": "I think the reason for reasons was because he knew he couldn't win this and a draw doesn't really do him any favour",
            "num_replies": 0
        },
        {
            "comment_id": "UgwF1SSS2w3FTKdomrN4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@faizhashmi7487",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Nice",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz2Mcr25p9dDGcJ7Sl4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@northshores7319",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "For a World Champion to say he does not even want to try is inexcusable. We have not seen a World Champion who plays with fire and ernest ambition since Kasparov. Gukesh needs to study the great games of the past like Fischer did instead of memorizing opening lines.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz5phQ0JuWn_ZafQ_Z4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Berserkerbaboen",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "It becomes harder and harder to like or comment. Google puts in a schwiBBenZug and rams a huge add in our noses when we push at comments. Trillions of us give up disgusted....",
            "num_replies": 0
        },
        {
            "comment_id": "UgwyZA_JOL3DyYzfAkB4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@kalodont1916",
            "date": "2025-02-11",
            "likes": 5,
            "comment": "4:57 Gukesh Dommaraju resigned the game and ... Vidit is out of the competition 😅😂😉",
            "num_replies": 1
        },
        {
            "comment_id": "UgxXKJJxrMzhtuEr_RZ4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@VKarthik-kh7bg",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Nice explanation",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw0o7GnSTFcG5-1AVV4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@nareshkumar-qg1ko",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "#suggestion Alireza semi final match",
            "num_replies": 0
        },
        {
            "comment_id": "UgwhYI5sbme0JrARCD94AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@cravengruesome9454",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "The random chess that we play is Capablanca chess. Everyone can be a Tal, or Dubov. No taint of silicone.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzY_TgIOySC9uhnC254AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@cravengruesome9454",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "We always play matches of four games in random chess the first two games have the same board and the one player plays white initially the second two games the other player plays white first. Some set ups just so favor white, like in the first set up in this match, that it would be unfair otherwise.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy3wvbwaAnvK_luOgp4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@cravengruesome9454",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "All that we play is random chess we are not interested in spelling bee chess where you memorize. As Bobby Fisher said I thought we played chess because we don't want to work. Every game is fresh and exciting.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwrurNUAh3AWUqAZp14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@adrianpaligar2026",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "That's why Fischer created chess 360 to preserve the art of chess not the art of memorizing moves.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz17ekB8Dj7blMgFoJ4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@kamleshamareshbabuji1114",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Agad, if u dont like indians, dont post videos then with these titles.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyQ783CKoMtsVI1U1F4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@ghanshyamjoshi587",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Preparatory players like Anish Giri and Gukesh will have a hard time in this format. Hoping for Fisher random to become mainstream.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyfyfNCEIuiZYIIwst4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@asokedas2977",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Whoever advised him to enter this Freestyle tournament has either good money in mind or overestimated his chess prowess. He is still learning positions, ways not to waste any moves and maximising returns and estimate opponent strategy. He was humiliated by precision of Fabi. His plus points are calculation, preparation and will to improve his games to the level of Magnus in shortest possible time. Freestyle is designed for older players unwilling to put in hours of prep for a classical game but paying well.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyvLfqJTypQ0zB_fv14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@kumarhrservices7542",
            "date": "2025-02-11",
            "likes": 4,
            "comment": "It's surprising how quickly the game can go out of control in this Chess 960 format!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw2Fg0KCtDHTA4TTGN4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@tusharkchess",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "I think luckily gukesh beat all the great players in candidates and able to win the even wc while beating ding but he doesn't deserve he is not that strong",
            "num_replies": 0
        },
        {
            "comment_id": "UgyjxnVAQAJ6PWTk3W14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@tucobenedicto1780",
            "date": "2025-02-11",
            "likes": 1,
            "comment": "Gukesh wins the world championship, and then is taken behind the woodshed by Magnus & Fabi.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzM1yiDrgL9M4HaNdB4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Hobbies-ve1iy",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "you just called gukesh world champion once in this one 😂",
            "num_replies": 0
        },
        {
            "comment_id": "UgwqrXXg7OlRKWjvyXp4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@One_God-x1t",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "So the youngest, greatest, sharpest, defeater of Ding, Magnus replacer classical world champion was not able to win the 1st & 2nd tournament, he participated after becoming world champion. He is going to be replaced soon. 😮",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx7TmU_e5M1SzjfvTt4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@ToniDerAlbaner",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "Agad, do you watch one piece by any chance?",
            "num_replies": 0
        },
        {
            "comment_id": "UgxDkmzkaIgN6Won3YR4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Prathamzz211",
            "date": "2025-02-11",
            "likes": 0,
            "comment": "It doesn’t matter if gukesh loses in chess960. He is still the world champion of real chess.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzTOqCkYdKixhqzHX94AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@iaminvincible4441",
            "date": "2025-02-10",
            "likes": 10,
            "comment": "Gukesh  is just memorising the theories and positions of entire known games of normal format. He is weak into an un explored territory. 360 chess is not for him.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyaxxVkvbP71jejMnZ4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@endlessbattle9211",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Weakest Classical World Champion: Gukesh.",
            "num_replies": 0
        },
        {
            "comment_id": "UgziPUPKQgHFVRQx5R94AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@UpTheCatters",
            "date": "2025-02-10",
            "likes": 12,
            "comment": "Damn, this style of chess really brings out tactical and positional strength a lot more",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx7gtCDYxevJwKyJTV4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@55555ehnx",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "I don't like this freestyle 😒",
            "num_replies": 0
        },
        {
            "comment_id": "UgyRf0lQ8mkSpF1PJSZ4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Jared7873",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "Hikaru made 4 mistakes in 5 moves 😭!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxvf1NiV2AOdqM2qo14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@scottberger6721",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "The best thing about Gukesh losing is that the chats and comments aren't being spammed with nonsense and projection. Many thanks to the chess gods.",
            "num_replies": 1
        },
        {
            "comment_id": "Ugw4Dgesin-ZKiRH_dN4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@gun23ner",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "great video once again",
            "num_replies": 0
        },
        {
            "comment_id": "UgxBvM14mCREJp2NPUl4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@firstfix1984",
            "date": "2025-02-10",
            "likes": 6,
            "comment": "Hi, you need another letter to show that it's a 960-style game. You have \"C\" for classical, \"R\" for rapid, maybe \"F\" for Fischer",
            "num_replies": 1
        },
        {
            "comment_id": "UgwKMgxoSX_-ZFSSJ954AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Subham9702",
            "date": "2025-02-10",
            "likes": 3,
            "comment": "Just because he is the world champion, you guys are barking so much. Get a petition to Magnus to play world championship. Who's stopping him? Gukesh has won the championship after winning the candidates. It's not like someone just handed him the trophy. Idiots.",
            "num_replies": 1
        },
        {
            "comment_id": "UgxVil3HatQbJ_HaZg94AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@AnjelLee-f8c",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "The older players are better at Freestyle. They have simply, played more chess.",
            "num_replies": 1
        },
        {
            "comment_id": "Ugyt6pbW6-uAFBJYPj14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@syoudipta",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "Take a bow, Magnus. Your ego has brought upon the chess world the great division and now real nobody's thinking they can mock the talent and achievements of the 18-year old Chess World Champion.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx4tuDpcMw0DbqE8At4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@solarcrystal5494",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "How come since Magnus abandoned the title, World champions don't seem to play chess like champions after they win?",
            "num_replies": 1
        },
        {
            "comment_id": "UgxMGMci0VGlIpRdLF54AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@delxinogaming6046",
            "date": "2025-02-10",
            "likes": 10,
            "comment": "Premature resignation! We’ve seen blunders in this format and time control. World champ should never give up",
            "num_replies": 8
        },
        {
            "comment_id": "UgwOma5yEN2MYTt2P8l4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@simonboyane1140",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Freestyle chess is real chess!",
            "num_replies": 0
        },
        {
            "comment_id": "UgxYuH0CFtly5Cy9YdN4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@dt0349",
            "date": "2025-02-10",
            "likes": 33,
            "comment": "This style of chess is a real test of skill, no memorizing bs",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz4u23nV9p1XaIvpVV4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@psr4550",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "I always told my friends that white ppl hate us, i also told them not to be nice when u see a westener cz remember they didnt even said sry for colonisation once. Comment section is a good proof haha\n\nHated mahatam gandhi for saying eye for an eye will make the world blind, cz if its blind its equal as anyways west will try to make us blind. Jews are better with the attitude of eye for an eye and tooth for a tooth",
            "num_replies": 0
        },
        {
            "comment_id": "UgwzdVUYxPTAS_3Omr14AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@wszczebrzeszyn",
            "date": "2025-02-10",
            "likes": 3,
            "comment": "Fabi had 97% accuracy, almost engine like.",
            "num_replies": 2
        },
        {
            "comment_id": "UgxeFHiV8djvAhAzxud4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@niallhoran5363",
            "date": "2025-02-10",
            "likes": 2,
            "comment": "Maturity is when you realise Gukesh was the world champion in a universe where Magnus didn't exist 💔",
            "num_replies": 1
        },
        {
            "comment_id": "Ugzq24u9ZWqT-PygkKt4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@MorenoChileOficial",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "In the end the good players prevail",
            "num_replies": 0
        },
        {
            "comment_id": "UgxVONvKrrrbJiZDYnB4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@LarbiElkeurti",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "#kasparov vs deep blue",
            "num_replies": 0
        },
        {
            "comment_id": "UgwBzb9zwQlF7wULOap4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@user-gr3tg2yk6o-24_डफ़क",
            "date": "2025-02-10",
            "likes": 11,
            "comment": "Gukesh is the new Ding 😂😂",
            "num_replies": 2
        },
        {
            "comment_id": "UgymbLtGuP7Mzvthbwt4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@Cthulhuliessleeping",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "this might be agadmators shortest video ever",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx58IWfHxUMDXsVCWN4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@AJB-003",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "👇🏻 spoiler blocker",
            "num_replies": 0
        },
        {
            "comment_id": "UgxUGhMz-c-iGUaUH_Z4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@navid9495",
            "date": "2025-02-10",
            "likes": 3,
            "comment": "take theory from this weak WC and he is done. now go back to your room and memorize some opening",
            "num_replies": 0
        },
        {
            "comment_id": "Ugwk_rGJlshpNn2Kxat4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@amitloutube",
            "date": "2025-02-10",
            "likes": 5,
            "comment": "as there is no prep and no theory its gonna get difficult for theoretical player than actual strong at chess players(like Alireza and Caruana and king magnus), yesterday simple queen sacrifice was missed...",
            "num_replies": 3
        },
        {
            "comment_id": "UgxhZL2SFqEC6f8KoJ94AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@michaelmassaro4375",
            "date": "2025-02-10",
            "likes": 11,
            "comment": "Gukesh did the right thing his position loss I don’t blame him . He hesitates sometimes he sees all the moves but does  not play the right move at times . I think he’s a bit overwhelmed by the format of Random . It can happen to any player  Fedoseev Levon and Alireza are examples as well . He is not alone but since he’s the WC people have to get their little jabs in . Most of those making malicious comments are clueless in more ways than one . I’m not overly impressed with random when it’s all said and done we’ll see how it measures up to other tournaments .",
            "num_replies": 7
        },
        {
            "comment_id": "UgwcWvq2_-1IyOfgIDd4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@rajsub3884",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Gukesh definitely not as strong as some hype his real test will come next year when he will face stronger challenger than weak accidental champion ding .still I will reserve if he is best in the world after magnus\nFabi in his prime drew all matches with peak magnus 2018 wc .had he get to play some other magnus would have been wc",
            "num_replies": 5
        },
        {
            "comment_id": "UgxcsWM6Vrcfm6F5sqF4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@ived7138",
            "date": "2025-02-10",
            "likes": 0,
            "comment": "Indians are good at committing to and recalling from memorization but they are not creative. The chess world is a great example of this.",
            "num_replies": 0
        },
        {
            "comment_id": "UgwUf2CcZ-Te4_xyn0R4AaABAg",
            "video_id": "xfae2AjUzAE",
            "author": "@eightatehate2320",
            "date": "2025-02-10",
            "likes": 1,
            "comment": "spoiler blocker",
            "num_replies": 0
        }
    ]
}