{
    "transcript": "# Magnus Blunders a Piece in the Opening! #\nhello everyone and welcome to an incredible game uh from round four of this year's freestyle chess Grand Slam vien house tournament um uh Vladimir fev versus Magnus Carlson and it's a game that is is really really weird the title of course is a joke as there are no openings here this is official random uh but still you know we we I guess we could say first 10 moves of the game are the opening phase of the game because theoretically it is possible to memorize all of the positions and then even openings uh you know for those positions I mean it's just that people are lazy no one is going to do that but it is possible so yeah let's check it out and see why this uh game is so weird uh Vladimir with white opens with Pawn to C4 sort of the the official random English opening we have Pawn to B6 by Magnus Pawn to D4 and Knight to F6 and here just a nice Knight to F3 so you can see that Vladimir is opening up the light sore Bishop Magnus is opening up the Queen uh towards the the the the white king and uh you know the the usual stuff we have Pawn to D5 uh C captures we have Queen captures on D5 already with a nice Rook Queen battery on the dile and Knight to D3 uh we have Pawn to C5 by Magnus D captures we have B captures and this is already where the the Trap is Set uh Believe It or Not Vladimir plays Pawn to B4 and what can Magnus do here why is this move so powerful well it seems like Vladimir blundered the game as Pawn to C4 and you have problems how are you defending this well the problem with this move is that if you play Knight C4 then the Knight comes back to B2 defends the rook and you've blundered your Rook on d8 as the pawn here defends the A5 Square so you cannot retreat with Queen to a A5 and best you can do is just to to give up the queen for Knight and Rook so Magnus of course doesn't do that he plays C captures on B4 removes that nasty pawn and now Bishop captures on B4 and Magnus seems to have uh forgotten about um the B4 square and he just castles King side here and now I would ask you to pause the video but I imagine it is not necessary as this is pretty pretty self-explanatory but just in case you know you you still don't see it you know have at it I'll give you a couple of seconds I'm just kidding I'm not I'm not going to give you a couple of seconds it's Knight to B2 The Rook is defended and Magnus just straight out blunders The Rook there's no Pawn on B4 but the bishop is sometimes an even better piece than a pawn it still covers the A5 square and there's just nothing Magnus can do here so Magnus of course gives up the queen uh for the for the rook and Knight Knight captures with have Rook captur on D1 with check and now Bishop back to E1 and okay Magnus still has some compensation for the queen so can he do something about this let's see what happens we have Bishop to A4 uh nicely developing also preparing Bishop to C2 if he can play that and win another piece uh that's going to go a long way we have Castle's King side and now comes Pawn to E5 uh if Bishop to C2 right away couldn't Magnus have just won that Bishop on B1 uh well he could have B then comes Bishop to D2 and all of a sudden The Rook on F1 is also defending the the bishop here so not really so after this castles we have Pawn to E5 uh going after the Knight on e4 Queen to B2 now the attacking the bishop on B8 and pawn to E4 Magnus offering to TR pieces but vlir says there's no reason to do that just KN back to D2 and The Rook on D1 is somewhat trapped we have Knight to B6 uh entering the game and also the bishop is now nicely defended Knight captures on e4 we have Knight captures on e4 and Bishop captures on e4 we have Rook to E8 and Bishop back to D3 uh we have Bishop to E5 by Magnus attacking the queen and Bishop to C3 now not just blocking the bishop but also going after the Rook on D1 and with this move Vladimir basically gets rid of um any attackers that Magnus might have used to to annoy his King so okay Bishop captures on C3 we have Queen captures and now comes Rook to C8 and uh Vladimir is winning here but only if he moves his Queen to a proper Square you can just move the queen anywhere otherwise you're going to be in trouble and again I could ask you to pause the video but I I imagine you guys are way way too strong for such a position of course Vladimir played Queen to B2 he could have have also played Queen to A3 it is important to just keep an eye on that C1 Square otherwise Magnus would just double up here and then it is Vladimir who has issues here but yeah Queen to B2 was played and now Magnus without a useful move he has to trade here captures captures Pawn to G6 and pawn to sorry Pawn to F3 Bishop to D7 now magnus's only option is to try and create some sort of a fortress he still does have a rook and the Knight versus a queen uh so Pawn to G4 Bishop to E6 and Now Pawn to H4 if you can get the pawn all the way uh to H6 then that's as good as winning there's no getting away from that so Rook to C5 here uh and queen to A3 attacking the rook and the pawn on A7 we have Rook to C7 defending and now King to F2 getting the king to a slightly safer Square before finishing the job we have Knight to D5 uh Queen to D6 attacking the rook and also preparing maybe some Knight maybe some Pawn E4 action and that will pretty much end the game so Rook to D7 attacking the queen and queen to B8 with check we have King to G7 Queen to E5 with check and King back to G8 Magnus inviting a repetition as he really has nothing better than that but Vladimir just played Pawn to H5 and he was in this position on move 30 that Magnus Carlson resigned the game as there is nothing more to be done here H6 is coming and then you are getting checkmated and there really isn't um anything you can play here if you capture just Queen captures your position opens up then you capture on H7 so there there's nothing that you can do there's nothing that you can threaten and there's nothing that V Magnus can even try so this was a really really weird game and uh one of the reasons why people are loving uh well Fisher random so much is that it's possible for you know Magnus Carlson the highest rated player in the world to blunder a piece on move 10 not on move 10 this was on on move eight actually so yeah I mean just incredible incredible uh concept here where where Magnus just castled he he has to move the queen and then the game can do is like Queen to B7 or queen d8 but he castled he probably thought okay that B4 Pawn was an issue but you know the bishop also has some of the qualities of the B4 Pawn A5 is also covered so yeah really really weird game weird blunder by Magnus but yeah of course lir will not complain he takes the full point and uh you know takes down Magnus Carson and he's not the only one who takes done Magnus Carson Fabiano Carana also defeated Magnus in round two so we'll see what happens there are five rounds today uh like I said use that hasht suggestion and I will go over some nice games and apologies for the weird video in the in the previous uh uh video I have no idea why that happened I never change anything in my settings uh like I said really really weird stuff uh so yeah that's the game hope you guys enjoyed it I would like to thank Ronnie Lai Andreas rosental Andre sh David bacon and and Andrew stanel for a contribution to my channel thank you a lot I really appreciate it as usual you can check to my previous videos here thank you for watching and I will see you soon continuing to check up on your wonderful suggestions and whatever else happens in the Chess World thank you all I will see you soon and have an excellent rest of your day",
    "video_metadata": {
        "title": "Magnus Blunders a Piece in the Opening!",
        "published_at": "2025-02-07",
        "view_count": "54130",
        "like_count": "1888",
        "comment_count": "119"
    },
    "comments": [
        {
            "comment_id": "UgyKGE1jke6f7BZ14Wp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@pauldacus4590",
            "date": "2025-02-07",
            "likes": 250,
            "comment": "Does anyone want to tell Agad that the board is wrong?",
            "num_replies": 12
        },
        {
            "comment_id": "UgxsV3fehMivg1ufvvR4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@serbach",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "“People are lazy; nobody is going to do that.” Hey! I resemble that remark!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx2xsCPY2fQKVbRSKd4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@matthiaskast5150",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "4:32 Would Queen d4 also work? Magnus cant double up because of backrank- issues and checkmate, so he would have to waste a move on that which gives the time to elliminate the other rook",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyfw3aBT28A9NCylKR4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@IndigoBassNotes",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "The Bishop/Pawn quip was said no doubt just to see how many people would comment about it.\n You Tube Comment puppets dance when you pull the strings.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxiqq7VqkV2tT7qmfF4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@Rkin-rj7lv",
            "date": "2025-02-09",
            "likes": 0,
            "comment": "People are lazy, that’s true, but not wanting to learn over a billion combinations doesn’t make you lazy",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz79sHPRrSXwo2uy4B4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@dacianbonta2840",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "fistoseev!",
            "num_replies": 0
        },
        {
            "comment_id": "UgyXuLXia93MBFgwMFN4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@douglasfoley2060",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "The “help! Help!” In the prior video were ghosts of chess games past. lolz",
            "num_replies": 0
        },
        {
            "comment_id": "UgxdIkYMH3QPyHvypHF4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@dillondelhoney714",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Shows that even the best grandmasters are human. Blunders are so easy to commit.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyzU76D6nYmp1do8uV4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@guptayush179",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Sir why do u keep changing your settings? My grandmother has difficulty watching your videos 😅😅",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyei1_o7WIXhI8szUR4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@guptayush179",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "How do u be a former world champion and not know that a bishop can do the job of a pawn? Was all of it fake? Were the last 10 years of chess history scripted???",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz9YsM-d2jf90plq614AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@kamleshamareshbabuji1114",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Now ding will say to magnus - welcome to the club of blunders 😂😂",
            "num_replies": 2
        },
        {
            "comment_id": "UgwW8Ij6LOOL9dV6AWx4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@ThanosLuvsDeath",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "The power of B4!!!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy0hHuFwpAIellkY5J4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@sid1gen",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Good one, agad! I fell for the title of the video, but will not watch it: I can't stand this random thing, so, pass",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx8ClH_1-izDX0ixq14AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@user-gr3tg2yk6o-24_डफ़क",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "lol … Magnus is good only for memorised classical lines.. he has no intuition to play new lines… chess 960 is not his world and he will continue to lose like an lDl0T 😂😂😂",
            "num_replies": 3
        },
        {
            "comment_id": "Ugyk0Rz6jWFap6E2pmV4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@chanpuiafanchun4068",
            "date": "2025-02-08",
            "likes": 1,
            "comment": "The man full of ego era has gone...",
            "num_replies": 1
        },
        {
            "comment_id": "UgxBVTocThQO22C275h4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@mayurvira1412",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Hi Agad - you have put the player ratings along with their names.. not sure if in freestyle players have ELO ratings same as their classical or rapid ratings..",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz7TBdLXClVwA8-Q0t4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@hp7639",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "When I see Agad I click. When I see Fischer random, I click out. 😅",
            "num_replies": 0
        },
        {
            "comment_id": "Ugx4I-iirm6ZoroOKj14AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@mdashrafuzzamansunny2145",
            "date": "2025-02-08",
            "likes": 1,
            "comment": "Regular chess is hard enough. I have no idea whats going on when I'm eatchin freestyle chess. Anyone else feel the same?",
            "num_replies": 0
        },
        {
            "comment_id": "UgwvSSJD8wdPz6s_3xB4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@user-xn3ms2dw4g",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Great game by Vladimir 🙂👏 \n\nTake down the overhyped magnus",
            "num_replies": 2
        },
        {
            "comment_id": "UgyGL7aXubV9qxy_4Qd4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@vinniche",
            "date": "2025-02-08",
            "likes": 0,
            "comment": "Why Fisher Random. It's bakwas.",
            "num_replies": 0
        },
        {
            "comment_id": "UgxFIspDy4OujStQVod4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@nedmerrill5705",
            "date": "2025-02-08",
            "likes": 2,
            "comment": "\"There are no openings.  This is Fischer Random.\"\nIt seems Magnus has a strange lacunae with Fischer Random.",
            "num_replies": 1
        },
        {
            "comment_id": "UgzKrkdZvaToIPZJFSN4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@ravivaradhan4956",
            "date": "2025-02-07",
            "likes": 32,
            "comment": "I love the Marcus Aurelius quote: \"what are you afraid of losing when nothing in the world belongs to you.\"",
            "num_replies": 3
        },
        {
            "comment_id": "UgypAg6rVi2Mzr4splh4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@vigenrshtuni6804",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "4:09 instead of Bxc3 he could go Bxh2 and then take the rook.",
            "num_replies": 1
        },
        {
            "comment_id": "UgzQB-et7CXq-wggxC94AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@JiminyBillyBobIII",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "3:33 you should say \"stuck\" as it ain't going anywhere, but it's also not yet lost.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyDfFTvNlFMQyMUXk54AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@rodneytrambly7913",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "Nevermind, white bishop was still in the way.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugyn7ga-RSaWI0bXjRd4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@rodneytrambly7913",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "What if instead of Be5, Bxh2 was played? Just curious of agadmator opinion of that forcing move to remove whites rook.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzY3duU2Vd0qT0ADX54AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@100_Dollar_Bill",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "Stupid format.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyjIuFIY-BsTIr8GDB4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@prayasjain8583",
            "date": "2025-02-07",
            "likes": 2,
            "comment": "4:04 Why not Bxh2+ winning the exchange?",
            "num_replies": 1
        },
        {
            "comment_id": "UgyOoGGjxGTBnIiMmtp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@ChicCanyon",
            "date": "2025-02-07",
            "likes": 2,
            "comment": "If fischer random becomes financially significant openings will absolutely be memorized",
            "num_replies": 0
        },
        {
            "comment_id": "UgzRvJ6TupntEtVONal4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@carlkligerman1981",
            "date": "2025-02-07",
            "likes": 2,
            "comment": "I have to admit to thoroughly enjoying watching Magnus getting a whooping today after all his whining & petulance & FIDE bashing.  It ought to be self evident why an exhibition tournament whose invitees and format are directed by ONE player, who in addition to PLAYING also has a stake in the business running the tournament!  A Fischer Random World Championship would have to be OPEN, be organised and judged by an INDEPENDENT body (FIDE would be the obvious choice) and involve a similar set of tournaments that actually determine THE world champion.  This reminds me too much of Kasparov (and Nigel Short if memory serves) and his beef with FIDE; people have short memories it seems.",
            "num_replies": 0
        },
        {
            "comment_id": "UgzXu9FX8UVD37eJFz94AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@pedroasencio3290",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "People are lazy... Or we have limitations?  Love your sense of humor agadmator!",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy28OBTXUTqmlizQsp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@badangblackheart",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "Does freestyle chess effect the rating?",
            "num_replies": 1
        },
        {
            "comment_id": "UgwU2lI3SWRg27W7WGh4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@otteottema6839",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "I don't understand why Magnus resigns. The king can escape to f8.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz38veC6_uJTKvSuux4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@1990gollum",
            "date": "2025-02-07",
            "likes": 51,
            "comment": "\"The bishop is sometimes an even better piece than the pawn.\"  I never stop learning new things from this channel.",
            "num_replies": 0
        },
        {
            "comment_id": "UgyYP_xU1FNqUXq-yml4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@stevesmith4600",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "\"It is possible to memorize all variations of openings\"?  I would like to see you support this claim.\n\nThere are 960 variations to starting positions, and classical chess has about 2,000 meaningful different openings.  Roughly estimating, that's almost 2-million different openings to memorize.  The human brain has physical limitations on the amount of information it can store.  While I do think that \"pattern\" recognition can and does occur (as the patterns for classical chess overlap with those from Fischer Random), memorizing 2 million variations without supporting such evidence seems like a wild and unbelievable claim to make.\n\nI would be happy to be proven wrong.  I just cannot tell if you actually have the evidence to know this statement as a fact, or if it is simply a wild claim.  Without seeing the evidence for myself, I have to place it into the latter category.",
            "num_replies": 2
        },
        {
            "comment_id": "Ugyz8jkiht5QRmIKTdp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@nicbentulan",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "magnus is still too chicken to face wesley so & nepo in classical 9LX for 5 years in a row. bigger sore loser, hypocrite, cheater & coward than weevil underwood, bandit keith, mohammed & light yagami combined. more talentless than nana hiiragi. LOL.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugxtc4mOoVlILvnTxSp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@LarbiElkeurti",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "We want to replay the immortal Kasparov match with more analysis and important lines that you did not mention",
            "num_replies": 0
        },
        {
            "comment_id": "UgxbSDRkqb0p2_ZdZ714AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@michaelmassaro4375",
            "date": "2025-02-07",
            "likes": 6,
            "comment": "I find Random chess an interesting concept where utilization of the pieces trying to position them and coordinating an attack it’s a good look at Chess skills from a different perspective than the usual regular positions of pieces . That in itself makes it very worthwhile . Thanks for the game Agadmator enjoy your day",
            "num_replies": 1
        },
        {
            "comment_id": "UgxrlAjK69x2K5JA-2h4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@rajpanda5065",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "Players somehow smoked Magnus today. He lost more matches in a day than he would in a year.",
            "num_replies": 0
        },
        {
            "comment_id": "Ugzh06om7jrvCNvLjSl4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@billrexhausen4221",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "I like how anonymous “people” are being accused of laziness for not having complete opening prep for 960 permutations. 😂",
            "num_replies": 0
        },
        {
            "comment_id": "UgzRkcut3FgPOIabAN14AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@luizfernandodesa4910",
            "date": "2025-02-07",
            "likes": 2,
            "comment": "These so called \"professional players\" can't even set up the pieces correctly. What a terrible state chess finds itself nowadays. 😡",
            "num_replies": 0
        },
        {
            "comment_id": "Ugz_RnsNkPR5m0b6ky54AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@michaelmassaro4375",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "Suggestion # Gukesh vs Hikaru Random Chess I heard Gukesh had winning chances I missed the blunder Hikaru as well miscues .I’d love to see Recap of the World Champ’s  game he hasn’t gained any serious footing in this event yet Thanks Agadmator",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw1RbZXXgjly8Y83eB4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@leftenanalim",
            "date": "2025-02-07",
            "likes": 9,
            "comment": "This shows, that without memorization of openings, the real chess is live! This is what Bobby Fischer used to complain. That memorization, in a way ruins chess.\n\nEven a nobody can beat Magnus Carlsen",
            "num_replies": 4
        },
        {
            "comment_id": "Ugzv6nrDcOHO12FjayJ4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@sentinels-vc4nk",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "GenG Arjun❤",
            "num_replies": 0
        },
        {
            "comment_id": "Ugy6WzD2G44pk63CutV4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@rcapone",
            "date": "2025-02-07",
            "likes": 0,
            "comment": "https://youtu.be/zDXoLSO3uTg?si=-a79EvslO4EwTy8N&t=280\nQuestion\nAfter Vlad played Queen to B2\nWhy didn't Magnus play Rook to C1?\nWorst case the Queen takes the Rook, then Magnus takes the other Rook, Vlad King takes Magnus' Rook \nMagnus has a Bishop and Knight for Vlad's Bishop\n\nIf Vlad takes the Rook on D1 then Magnus retakes and Checkmate??",
            "num_replies": 0
        },
        {
            "comment_id": "UgymC4nl6UMgNxPqs-l4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@rajasaha354",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "Bad mistake by Magnus carlsen 😂❤",
            "num_replies": 0
        },
        {
            "comment_id": "UgxiIfc1kfoNG1PVZNp4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@georgeantonelis2863",
            "date": "2025-02-07",
            "likes": 6,
            "comment": "On this format, I would very kuch prefer if there was an evaluation bar in your recaps. It helps me out with evaluating every move as I often kiss obvious tactics in these new and complicated positions",
            "num_replies": 3
        },
        {
            "comment_id": "UgwnUO_RCet8Ueuspvd4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@Mrfchy",
            "date": "2025-02-07",
            "likes": 18,
            "comment": "\"Bishop is Sometime better piece than a pawn\" - Antonio, 2025",
            "num_replies": 0
        },
        {
            "comment_id": "Ugw8Ul3T0xO0DwDRoDV4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@ramachandra776",
            "date": "2025-02-07",
            "likes": 5,
            "comment": "No matter what the starting position, play b4 every time with white . You can take down Magnus himself . 😊",
            "num_replies": 0
        },
        {
            "comment_id": "UgwWCT4gxXJE7aOijqF4AaABAg",
            "video_id": "zDXoLSO3uTg",
            "author": "@gamingooze7836",
            "date": "2025-02-07",
            "likes": 1,
            "comment": "2:20 Be7?",
            "num_replies": 1
        }
    ]
}